[NoCoverage] BlockStatement
services/colorService.js:11:35
   /**
    * Convert XY coordinates to RGB
    */
-  xyToRgb(x, y, brightness = 100) {
-    return xyToRgb(x, y, brightness);
-  }
+  xyToRgb(x, y, brightness = 100) {}
 
   /**

[NoCoverage] BlockStatement
services/colorService.js:18:39
   /**
    * Convert mirek to RGB
    */
-  mirekToRgb(mirek, brightness = 100) {
-    return mirekToRgb(mirek, brightness);
-  }
+  mirekToRgb(mirek, brightness = 100) {}
 
   /**

[Killed] BlockStatement
services/colorService.js:25:24
   /**
    * Get CSS color for a light
    */
-  getLightColor(light) {
-    return getLightColor(light);
-  }
+  getLightColor(light) {}
 
   /**
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BlockStatement
services/colorService.js:32:37
   /**
    * Get shadow styling for a light
    */
-  getLightShadow(light, lightColor) {
-    return getLightShadow(light, lightColor);
-  }
+  getLightShadow(light, lightColor) {}
 
   /**
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected undefined to be truthy

[Killed] BlockStatement
services/colorService.js:44:26
   enrichLight(light) {
     // Determine color source
     let colorSource = null;
-    if (light.color?.xy) {
-      colorSource = 'xy';
-    } else if (light.color_temperature?.mirek) {
+    if (light.color?.xy) {} else if (light.color_temperature?.mirek) {
       colorSource = 'temperature';
     } else if (light.on?.on) {
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected null to be 'xy' // Object.is equality

[Killed] ConditionalExpression
services/colorService.js:44:9
   enrichLight(light) {
     // Determine color source
     let colorSource = null;
-    if (light.color?.xy) {
+    if (true) {
       colorSource = 'xy';
     } else if (light.color_temperature?.mirek) {
killedBy: ColorService enrichLight should enrich light with color temperature data
statusReason: expected 'xy' to be 'temperature' // Object.is equality

[Killed] StringLiteral
services/colorService.js:45:21
     // Determine color source
     let colorSource = null;
     if (light.color?.xy) {
-      colorSource = 'xy';
+      colorSource = "";
     } else if (light.color_temperature?.mirek) {
       colorSource = 'temperature';
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected '' to be 'xy' // Object.is equality

[Killed] OptionalChaining
services/colorService.js:46:16
     let colorSource = null;
     if (light.color?.xy) {
       colorSource = 'xy';
-    } else if (light.color_temperature?.mirek) {
+    } else if (light.color_temperature.mirek) {
       colorSource = 'temperature';
     } else if (light.on?.on) {
killedBy: ColorService enrichLight should use fallback color when no color data present
statusReason: Cannot read properties of undefined (reading 'mirek')

[Killed] ConditionalExpression
services/colorService.js:46:16
     let colorSource = null;
     if (light.color?.xy) {
       colorSource = 'xy';
-    } else if (light.color_temperature?.mirek) {
+    } else if (true) {
       colorSource = 'temperature';
     } else if (light.on?.on) {
killedBy: ColorService enrichLight should use fallback color when no color data present
statusReason: expected 'temperature' to be 'fallback' // Object.is equality

[Killed] ConditionalExpression
services/colorService.js:48:16
       colorSource = 'xy';
     } else if (light.color_temperature?.mirek) {
       colorSource = 'temperature';
-    } else if (light.on?.on) {
+    } else if (false) {
       colorSource = 'fallback';
     }
killedBy: ColorService enrichLight should use fallback color when no color data present
statusReason: expected null to be 'fallback' // Object.is equality

[Killed] OptionalChaining
services/colorService.js:48:16
       colorSource = 'xy';
     } else if (light.color_temperature?.mirek) {
       colorSource = 'temperature';
-    } else if (light.on?.on) {
+    } else if (light.on.on) {
       colorSource = 'fallback';
     }
killedBy: ColorService enrichLight should handle missing on state (defaults to false)
statusReason: Cannot read properties of undefined (reading 'on')

[Killed] ConditionalExpression
services/colorService.js:61:13
     // Return enriched light with additional properties
     return {
       id: light.id,
-      name: light.metadata?.name || 'Unknown',
+      name: true,
       on: light.on?.on ?? false,
       brightness: light.dimming?.brightness ?? 0,
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected true to be 'Living Room 1' // Object.is equality

[Killed] ConditionalExpression
services/colorService.js:61:13
     // Return enriched light with additional properties
     return {
       id: light.id,
-      name: light.metadata?.name || 'Unknown',
+      name: false,
       on: light.on?.on ?? false,
       brightness: light.dimming?.brightness ?? 0,
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected false to be 'Living Room 1' // Object.is equality

[Killed] BooleanLiteral
services/colorService.js:62:27
     return {
       id: light.id,
       name: light.metadata?.name || 'Unknown',
-      on: light.on?.on ?? false,
+      on: light.on?.on ?? true,
       brightness: light.dimming?.brightness ?? 0,
       color,
killedBy: ColorService enrichLight should handle missing on state (defaults to false)
statusReason: expected true to be false // Object.is equality

[Killed] OptionalChaining
services/colorService.js:62:11
     return {
       id: light.id,
       name: light.metadata?.name || 'Unknown',
-      on: light.on?.on ?? false,
+      on: light.on.on ?? false,
       brightness: light.dimming?.brightness ?? 0,
       color,
killedBy: ColorService enrichLight should handle missing on state (defaults to false)
statusReason: Cannot read properties of undefined (reading 'on')

[Killed] OptionalChaining
services/colorService.js:63:19
       id: light.id,
       name: light.metadata?.name || 'Unknown',
       on: light.on?.on ?? false,
-      brightness: light.dimming?.brightness ?? 0,
+      brightness: light.dimming.brightness ?? 0,
       color,
       shadow,
killedBy: ColorService enrichLight should handle missing brightness (defaults to 0)
statusReason: Cannot read properties of undefined (reading 'brightness')

[Killed] LogicalOperator
services/colorService.js:63:19
       id: light.id,
       name: light.metadata?.name || 'Unknown',
       on: light.on?.on ?? false,
-      brightness: light.dimming?.brightness ?? 0,
+      brightness: light.dimming?.brightness && 0,
       color,
       shadow,
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected +0 to be 80 // Object.is equality

[Killed] BlockStatement
services/colorService.js:77:24
    * @param {Array} lights - Array of raw Hue light objects
    * @returns {Array} Array of enriched light objects
    */
-  enrichLights(lights) {
-    return lights.map(light => this.enrichLight(light));
-  }
+  enrichLights(lights) {}
 }
 
killedBy: ColorService enrichLights should enrich multiple lights
statusReason: Target cannot be null or undefined.

[Killed] ArrowFunction
services/colorService.js:78:23
    * @returns {Array} Array of enriched light objects
    */
   enrichLights(lights) {
-    return lights.map(light => this.enrichLight(light));
+    return lights.map(() => undefined);
   }
 }
killedBy: ColorService enrichLights should enrich multiple lights
statusReason: Cannot read properties of undefined (reading 'id')
