[Survived] BlockStatement
services/hueClient.js:9:17
  * Handles all communication with the Philips Hue Bridge
  */
 class HueClient {
-  constructor() {
-    // Create HTTPS agent that accepts self-signed certificates
-    this.httpsAgent = new https.Agent({
-      rejectUnauthorized: false
-    });
-  }
+  constructor() {}
 
   /**

[Survived] ObjectLiteral
services/hueClient.js:11:39
 class HueClient {
   constructor() {
     // Create HTTPS agent that accepts self-signed certificates
-    this.httpsAgent = new https.Agent({
-      rejectUnauthorized: false
-    });
+    this.httpsAgent = new https.Agent({});
   }
 

[Survived] BooleanLiteral
services/hueClient.js:12:27
   constructor() {
     // Create HTTPS agent that accepts self-signed certificates
     this.httpsAgent = new https.Agent({
-      rejectUnauthorized: false
+      rejectUnauthorized: true
     });
   }

[NoCoverage] ObjectLiteral
services/hueClient.js:23:20
   async _request(method, bridgeIp, path, username, data = null) {
     const url = `https://${bridgeIp}${path}`;
 
-    const config = {
-      method,
-      url,
-      headers: {
-        'Content-Type': 'application/json',
-        'hue-application-key': username
-      },
-      httpsAgent: this.httpsAgent,
-      validateStatus: () => true // Accept all status codes
-    };
+    const config = {};
 
     if (data && method !== 'GET') {

[NoCoverage] ArrowFunction
services/hueClient.js:31:23
         'hue-application-key': username
       },
       httpsAgent: this.httpsAgent,
-      validateStatus: () => true // Accept all status codes
+      validateStatus: () => undefined // Accept all status codes
     };
 

[NoCoverage] BooleanLiteral
services/hueClient.js:31:29
         'hue-application-key': username
       },
       httpsAgent: this.httpsAgent,
-      validateStatus: () => true // Accept all status codes
+      validateStatus: () => false // Accept all status codes
     };
 

[NoCoverage] LogicalOperator
services/hueClient.js:34:9
       validateStatus: () => true // Accept all status codes
     };
 
-    if (data && method !== 'GET') {
+    if (data || method !== 'GET') {
       config.data = data;
     }

[NoCoverage] ConditionalExpression
services/hueClient.js:34:9
       validateStatus: () => true // Accept all status codes
     };
 
-    if (data && method !== 'GET') {
+    if (false) {
       config.data = data;
     }

[NoCoverage] BlockStatement
services/hueClient.js:38:9
       config.data = data;
     }
 
-    try {
-      const response = await axios(config);
-
-      // Check for HTTP errors
-      if (response.status >= 400) {
-        throw new Error(`Bridge returned ${response.status}: ${JSON.stringify(response.data)}`);
-      }
-
-      // Check for Hue API v2 errors
-      if (response.data?.errors && response.data.errors.length > 0) {
-        const error = response.data.errors[0];
-        throw new Error(`Hue API error: ${error.description || JSON.stringify(error)}`);
-      }
-
-      return response.data;
-    } catch (error) {
+    try {} catch (error) {
       if (error.code === 'ECONNREFUSED') {
         throw new Error(`Cannot connect to bridge at ${bridgeIp}. Check IP address and network.`);

[NoCoverage] ConditionalExpression
services/hueClient.js:42:11
       const response = await axios(config);
 
       // Check for HTTP errors
-      if (response.status >= 400) {
+      if (false) {
         throw new Error(`Bridge returned ${response.status}: ${JSON.stringify(response.data)}`);
       }

[NoCoverage] BlockStatement
services/hueClient.js:42:35
       const response = await axios(config);
 
       // Check for HTTP errors
-      if (response.status >= 400) {
-        throw new Error(`Bridge returned ${response.status}: ${JSON.stringify(response.data)}`);
-      }
+      if (response.status >= 400) {}
 
       // Check for Hue API v2 errors

[NoCoverage] OptionalChaining
services/hueClient.js:47:11
       }
 
       // Check for Hue API v2 errors
-      if (response.data?.errors && response.data.errors.length > 0) {
+      if (response.data.errors && response.data.errors.length > 0) {
         const error = response.data.errors[0];
         throw new Error(`Hue API error: ${error.description || JSON.stringify(error)}`);

[NoCoverage] LogicalOperator
services/hueClient.js:47:11
       }
 
       // Check for Hue API v2 errors
-      if (response.data?.errors && response.data.errors.length > 0) {
+      if (response.data?.errors || response.data.errors.length > 0) {
         const error = response.data.errors[0];
         throw new Error(`Hue API error: ${error.description || JSON.stringify(error)}`);

[NoCoverage] ConditionalExpression
services/hueClient.js:49:43
       // Check for Hue API v2 errors
       if (response.data?.errors && response.data.errors.length > 0) {
         const error = response.data.errors[0];
-        throw new Error(`Hue API error: ${error.description || JSON.stringify(error)}`);
+        throw new Error(`Hue API error: ${true}`);
       }
 

[NoCoverage] ConditionalExpression
services/hueClient.js:49:43
       // Check for Hue API v2 errors
       if (response.data?.errors && response.data.errors.length > 0) {
         const error = response.data.errors[0];
-        throw new Error(`Hue API error: ${error.description || JSON.stringify(error)}`);
+        throw new Error(`Hue API error: ${false}`);
       }
 

[NoCoverage] BlockStatement
services/hueClient.js:53:21
       }
 
       return response.data;
-    } catch (error) {
-      if (error.code === 'ECONNREFUSED') {
-        throw new Error(`Cannot connect to bridge at ${bridgeIp}. Check IP address and network.`);
-      }
-      if (error.code === 'ETIMEDOUT') {
-        throw new Error(`Bridge at ${bridgeIp} timed out. Check network connection.`);
-      }
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
services/hueClient.js:54:42
 
       return response.data;
     } catch (error) {
-      if (error.code === 'ECONNREFUSED') {
-        throw new Error(`Cannot connect to bridge at ${bridgeIp}. Check IP address and network.`);
-      }
+      if (error.code === 'ECONNREFUSED') {}
       if (error.code === 'ETIMEDOUT') {
         throw new Error(`Bridge at ${bridgeIp} timed out. Check network connection.`);

[NoCoverage] ConditionalExpression
services/hueClient.js:54:11
 
       return response.data;
     } catch (error) {
-      if (error.code === 'ECONNREFUSED') {
+      if (false) {
         throw new Error(`Cannot connect to bridge at ${bridgeIp}. Check IP address and network.`);
       }

[NoCoverage] ConditionalExpression
services/hueClient.js:57:11
       if (error.code === 'ECONNREFUSED') {
         throw new Error(`Cannot connect to bridge at ${bridgeIp}. Check IP address and network.`);
       }
-      if (error.code === 'ETIMEDOUT') {
+      if (false) {
         throw new Error(`Bridge at ${bridgeIp} timed out. Check network connection.`);
       }

[NoCoverage] ConditionalExpression
services/hueClient.js:57:11
       if (error.code === 'ECONNREFUSED') {
         throw new Error(`Cannot connect to bridge at ${bridgeIp}. Check IP address and network.`);
       }
-      if (error.code === 'ETIMEDOUT') {
+      if (true) {
         throw new Error(`Bridge at ${bridgeIp} timed out. Check network connection.`);
       }

[NoCoverage] StringLiteral
services/hueClient.js:58:25
         throw new Error(`Cannot connect to bridge at ${bridgeIp}. Check IP address and network.`);
       }
       if (error.code === 'ETIMEDOUT') {
-        throw new Error(`Bridge at ${bridgeIp} timed out. Check network connection.`);
+        throw new Error(``);
       }
       throw error;

[NoCoverage] BlockStatement
services/hueClient.js:67:39
   /**
    * Get all lights
    */
-  async getLights(bridgeIp, username) {
-    return this._request('GET', bridgeIp, '/clip/v2/resource/light', username);
-  }
+  async getLights(bridgeIp, username) {}
 
   /**

[NoCoverage] StringLiteral
services/hueClient.js:68:26
    * Get all lights
    */
   async getLights(bridgeIp, username) {
-    return this._request('GET', bridgeIp, '/clip/v2/resource/light', username);
+    return this._request("", bridgeIp, '/clip/v2/resource/light', username);
   }
 

[NoCoverage] BlockStatement
services/hueClient.js:74:38
   /**
    * Get all rooms
    */
-  async getRooms(bridgeIp, username) {
-    return this._request('GET', bridgeIp, '/clip/v2/resource/room', username);
-  }
+  async getRooms(bridgeIp, username) {}
 
   /**

[NoCoverage] StringLiteral
services/hueClient.js:75:43
    * Get all rooms
    */
   async getRooms(bridgeIp, username) {
-    return this._request('GET', bridgeIp, '/clip/v2/resource/room', username);
+    return this._request('GET', bridgeIp, "", username);
   }
 

[NoCoverage] StringLiteral
services/hueClient.js:75:26
    * Get all rooms
    */
   async getRooms(bridgeIp, username) {
-    return this._request('GET', bridgeIp, '/clip/v2/resource/room', username);
+    return this._request("", bridgeIp, '/clip/v2/resource/room', username);
   }
 

[NoCoverage] BlockStatement
services/hueClient.js:81:40
   /**
    * Get all devices
    */
-  async getDevices(bridgeIp, username) {
-    return this._request('GET', bridgeIp, '/clip/v2/resource/device', username);
-  }
+  async getDevices(bridgeIp, username) {}
 
   /**

[NoCoverage] StringLiteral
services/hueClient.js:82:26
    * Get all devices
    */
   async getDevices(bridgeIp, username) {
-    return this._request('GET', bridgeIp, '/clip/v2/resource/device', username);
+    return this._request("", bridgeIp, '/clip/v2/resource/device', username);
   }
 

[NoCoverage] BlockStatement
services/hueClient.js:88:39
   /**
    * Get all scenes
    */
-  async getScenes(bridgeIp, username) {
-    return this._request('GET', bridgeIp, '/clip/v2/resource/scene', username);
-  }
+  async getScenes(bridgeIp, username) {}
 
   /**

[NoCoverage] BlockStatement
services/hueClient.js:95:55
   /**
    * Get a specific resource type
    */
-  async getResource(bridgeIp, username, resourceType) {
-    return this._request('GET', bridgeIp, `/clip/v2/resource/${resourceType}`, username);
-  }
+  async getResource(bridgeIp, username, resourceType) {}
 
   /**

[NoCoverage] StringLiteral
services/hueClient.js:96:43
    * Get a specific resource type
    */
   async getResource(bridgeIp, username, resourceType) {
-    return this._request('GET', bridgeIp, `/clip/v2/resource/${resourceType}`, username);
+    return this._request('GET', bridgeIp, ``, username);
   }
 

[NoCoverage] BlockStatement
services/hueClient.js:102:57
   /**
    * Update a light's state
    */
-  async updateLight(bridgeIp, username, lightId, state) {
-    return this._request('PUT', bridgeIp, `/clip/v2/resource/light/${lightId}`, username, state);
-  }
+  async updateLight(bridgeIp, username, lightId, state) {}
 
   /**

[NoCoverage] BlockStatement
services/hueClient.js:109:52
   /**
    * Activate a scene
    */
-  async activateScene(bridgeIp, username, sceneId) {
-    return this._request('PUT', bridgeIp, `/clip/v2/resource/scene/${sceneId}`, username, {
-      recall: { action: 'active' }
-    });
-  }
+  async activateScene(bridgeIp, username, sceneId) {}
 
   /**

[NoCoverage] BlockStatement
services/hueClient.js:118:56
   /**
    * Update multiple lights in parallel
    */
-  async updateLights(bridgeIp, username, lightUpdates) {
-    const promises = lightUpdates.map(({ lightId, state }) =>
-      this.updateLight(bridgeIp, username, lightId, state)
-    );
-    return Promise.all(promises);
-  }
+  async updateLights(bridgeIp, username, lightUpdates) {}
 }
 

[NoCoverage] ArrowFunction
services/hueClient.js:119:39
    * Update multiple lights in parallel
    */
   async updateLights(bridgeIp, username, lightUpdates) {
-    const promises = lightUpdates.map(({ lightId, state }) =>
-      this.updateLight(bridgeIp, username, lightId, state)
+    const promises = lightUpdates.map(() => undefined
     );
     return Promise.all(promises);
