[Killed] LogicalOperator
services/motionService.js:15:9
    * @returns {Array} Array of motion sensor objects
    */
   parseMotionSensors(behaviorsData, motionAreasData) {
-    if (!behaviorsData?.data || !motionAreasData?.data) return [];
+    if (!behaviorsData?.data && !motionAreasData?.data) return [];
 
     // Create a map of motion area IDs to their motion status
killedBy: MotionService parseMotionSensors should return empty array when no behaviors data
statusReason: Cannot read properties of null (reading 'data')

[Killed] ConditionalExpression
services/motionService.js:15:9
    * @returns {Array} Array of motion sensor objects
    */
   parseMotionSensors(behaviorsData, motionAreasData) {
-    if (!behaviorsData?.data || !motionAreasData?.data) return [];
+    if (false) return [];
 
     // Create a map of motion area IDs to their motion status
killedBy: MotionService parseMotionSensors should return empty array when no behaviors data
statusReason: Cannot read properties of null (reading 'data')

[Killed] BlockStatement
services/motionService.js:19:42
 
     // Create a map of motion area IDs to their motion status
     const motionStatusMap = {};
-    motionAreasData.data.forEach(area => {
-      motionStatusMap[area.id] = {
-        motionDetected: area.motion?.motion || false,
-        motionValid: area.motion?.motion_valid !== false,
-        enabled: area.enabled !== false,
-        lastChanged: area.motion?.motion_report?.changed
-      };
-    });
+    motionAreasData.data.forEach(area => {});
 
     // Extract MotionAware zones from behaviors and combine with motion status
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
services/motionService.js:21:48
     const motionStatusMap = {};
     motionAreasData.data.forEach(area => {
       motionStatusMap[area.id] = {
-        motionDetected: area.motion?.motion || false,
+        motionDetected: area.motion?.motion || true,
         motionValid: area.motion?.motion_valid !== false,
         enabled: area.enabled !== false,
killedBy: MotionService parseMotionSensors should default motion detected to false when missing
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
services/motionService.js:21:25
     const motionStatusMap = {};
     motionAreasData.data.forEach(area => {
       motionStatusMap[area.id] = {
-        motionDetected: area.motion?.motion || false,
+        motionDetected: true,
         motionValid: area.motion?.motion_valid !== false,
         enabled: area.enabled !== false,
killedBy: MotionService parseMotionSensors should default motion detected to false when missing
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
services/motionService.js:22:22
     motionAreasData.data.forEach(area => {
       motionStatusMap[area.id] = {
         motionDetected: area.motion?.motion || false,
-        motionValid: area.motion?.motion_valid !== false,
+        motionValid: false,
         enabled: area.enabled !== false,
         lastChanged: area.motion?.motion_report?.changed
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
services/motionService.js:22:52
     motionAreasData.data.forEach(area => {
       motionStatusMap[area.id] = {
         motionDetected: area.motion?.motion || false,
-        motionValid: area.motion?.motion_valid !== false,
+        motionValid: area.motion?.motion_valid !== true,
         enabled: area.enabled !== false,
         lastChanged: area.motion?.motion_report?.changed
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
services/motionService.js:23:35
       motionStatusMap[area.id] = {
         motionDetected: area.motion?.motion || false,
         motionValid: area.motion?.motion_valid !== false,
-        enabled: area.enabled !== false,
+        enabled: area.enabled !== true,
         lastChanged: area.motion?.motion_report?.changed
       };
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
services/motionService.js:23:18
       motionStatusMap[area.id] = {
         motionDetected: area.motion?.motion || false,
         motionValid: area.motion?.motion_valid !== false,
-        enabled: area.enabled !== false,
+        enabled: false,
         lastChanged: area.motion?.motion_report?.changed
       };
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
services/motionService.js:24:22
         motionDetected: area.motion?.motion || false,
         motionValid: area.motion?.motion_valid !== false,
         enabled: area.enabled !== false,
-        lastChanged: area.motion?.motion_report?.changed
+        lastChanged: area.motion?.motion_report.changed
       };
     });
killedBy: MotionService parseMotionSensors should filter out non-MotionAware behaviors
statusReason: Cannot read properties of undefined (reading 'changed')

[Survived] OptionalChaining
services/motionService.js:24:22
         motionDetected: area.motion?.motion || false,
         motionValid: area.motion?.motion_valid !== false,
         enabled: area.enabled !== false,
-        lastChanged: area.motion?.motion_report?.changed
+        lastChanged: area.motion.motion_report?.changed
       };
     });

[Killed] MethodExpression
services/motionService.js:29:25
     });
 
     // Extract MotionAware zones from behaviors and combine with motion status
-    const motionZones = behaviorsData.data
-      .filter(behavior =>
-        behavior.configuration?.motion?.motion_service?.rtype === 'convenience_area_motion'
-      )
+    const motionZones = behaviorsData.data
       .map(behavior => {
         const motionServiceId = behavior.configuration.motion.motion_service.rid;
killedBy: MotionService parseMotionSensors should filter out non-MotionAware behaviors
statusReason: Cannot read properties of undefined (reading 'motion_service')

[Killed] MethodExpression
services/motionService.js:29:25
     });
 
     // Extract MotionAware zones from behaviors and combine with motion status
-    const motionZones = behaviorsData.data
-      .filter(behavior =>
-        behavior.configuration?.motion?.motion_service?.rtype === 'convenience_area_motion'
-      )
-      .map(behavior => {
-        const motionServiceId = behavior.configuration.motion.motion_service.rid;
-        const status = motionStatusMap[motionServiceId] || {};
-
-        return {
-          id: behavior.id,
-          name: behavior.metadata?.name || 'Unknown Zone',
-          motionDetected: status.motionDetected || false,
-          enabled: behavior.enabled && status.enabled,
-          reachable: status.motionValid !== false,
-          lastChanged: status.lastChanged
-        };
-      })
-      .sort((a, b) => a.name.localeCompare(b.name)); // Sort alphabetically
+    const motionZones = behaviorsData.data.filter(behavior => behavior.configuration?.motion?.motion_service?.rtype === 'convenience_area_motion').map(behavior => {
+  const motionServiceId = behavior.configuration.motion.motion_service.rid;
+  const status = motionStatusMap[motionServiceId] || {};
+  return {
+    id: behavior.id,
+    name: behavior.metadata?.name || 'Unknown Zone',
+    motionDetected: status.motionDetected || false,
+    enabled: behavior.enabled && status.enabled,
+    reachable: status.motionValid !== false,
+    lastChanged: status.lastChanged
+  };
+}); // Sort alphabetically
 
     return motionZones;
killedBy: MotionService parseMotionSensors should sort zones alphabetically by name
statusReason: expected 'Zzz Garage' to be 'Aaa Entrance' // Object.is equality

[Killed] ArrowFunction
services/motionService.js:30:15
 
     // Extract MotionAware zones from behaviors and combine with motion status
     const motionZones = behaviorsData.data
-      .filter(behavior =>
-        behavior.configuration?.motion?.motion_service?.rtype === 'convenience_area_motion'
+      .filter(() => undefined
       )
       .map(behavior => {
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
services/motionService.js:31:9
     // Extract MotionAware zones from behaviors and combine with motion status
     const motionZones = behaviorsData.data
       .filter(behavior =>
-        behavior.configuration?.motion?.motion_service?.rtype === 'convenience_area_motion'
+        false
       )
       .map(behavior => {
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected [] to have a length of 1 but got +0

[Killed] OptionalChaining
services/motionService.js:31:9
     // Extract MotionAware zones from behaviors and combine with motion status
     const motionZones = behaviorsData.data
       .filter(behavior =>
-        behavior.configuration?.motion?.motion_service?.rtype === 'convenience_area_motion'
+        behavior.configuration?.motion.motion_service?.rtype === 'convenience_area_motion'
       )
       .map(behavior => {
killedBy: MotionService parseMotionSensors should filter out non-MotionAware behaviors
statusReason: Cannot read properties of undefined (reading 'motion_service')

[Killed] BlockStatement
services/motionService.js:33:24
       .filter(behavior =>
         behavior.configuration?.motion?.motion_service?.rtype === 'convenience_area_motion'
       )
-      .map(behavior => {
-        const motionServiceId = behavior.configuration.motion.motion_service.rid;
-        const status = motionStatusMap[motionServiceId] || {};
-
-        return {
-          id: behavior.id,
-          name: behavior.metadata?.name || 'Unknown Zone',
-          motionDetected: status.motionDetected || false,
-          enabled: behavior.enabled && status.enabled,
-          reachable: status.motionValid !== false,
-          lastChanged: status.lastChanged
-        };
-      })
+      .map(behavior => {})
       .sort((a, b) => a.name.localeCompare(b.name)); // Sort alphabetically
 
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
services/motionService.js:35:24
       )
       .map(behavior => {
         const motionServiceId = behavior.configuration.motion.motion_service.rid;
-        const status = motionStatusMap[motionServiceId] || {};
+        const status = motionStatusMap[motionServiceId] && {};
 
         return {
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
services/motionService.js:35:24
       )
       .map(behavior => {
         const motionServiceId = behavior.configuration.motion.motion_service.rid;
-        const status = motionStatusMap[motionServiceId] || {};
+        const status = true;
 
         return {
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
services/motionService.js:39:17
 
         return {
           id: behavior.id,
-          name: behavior.metadata?.name || 'Unknown Zone',
+          name: false,
           motionDetected: status.motionDetected || false,
           enabled: behavior.enabled && status.enabled,
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be 'Living Room Motion' // Object.is equality

[Killed] ConditionalExpression
services/motionService.js:39:17
 
         return {
           id: behavior.id,
-          name: behavior.metadata?.name || 'Unknown Zone',
+          name: true,
           motionDetected: status.motionDetected || false,
           enabled: behavior.enabled && status.enabled,
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected true to be 'Living Room Motion' // Object.is equality

[Killed] LogicalOperator
services/motionService.js:40:27
         return {
           id: behavior.id,
           name: behavior.metadata?.name || 'Unknown Zone',
-          motionDetected: status.motionDetected || false,
+          motionDetected: status.motionDetected && false,
           enabled: behavior.enabled && status.enabled,
           reachable: status.motionValid !== false,
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
services/motionService.js:40:27
         return {
           id: behavior.id,
           name: behavior.metadata?.name || 'Unknown Zone',
-          motionDetected: status.motionDetected || false,
+          motionDetected: true,
           enabled: behavior.enabled && status.enabled,
           reachable: status.motionValid !== false,
killedBy: MotionService parseMotionSensors should handle missing motion status data
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
services/motionService.js:41:20
           id: behavior.id,
           name: behavior.metadata?.name || 'Unknown Zone',
           motionDetected: status.motionDetected || false,
-          enabled: behavior.enabled && status.enabled,
+          enabled: behavior.enabled || status.enabled,
           reachable: status.motionValid !== false,
           lastChanged: status.lastChanged
killedBy: MotionService parseMotionSensors should handle missing motion status data
statusReason: expected true to be undefined

[Killed] ConditionalExpression
services/motionService.js:41:20
           id: behavior.id,
           name: behavior.metadata?.name || 'Unknown Zone',
           motionDetected: status.motionDetected || false,
-          enabled: behavior.enabled && status.enabled,
+          enabled: true,
           reachable: status.motionValid !== false,
           lastChanged: status.lastChanged
killedBy: MotionService parseMotionSensors should handle missing motion status data
statusReason: expected true to be undefined

[Killed] BooleanLiteral
services/motionService.js:42:45
           name: behavior.metadata?.name || 'Unknown Zone',
           motionDetected: status.motionDetected || false,
           enabled: behavior.enabled && status.enabled,
-          reachable: status.motionValid !== false,
+          reachable: status.motionValid !== true,
           lastChanged: status.lastChanged
         };
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
services/motionService.js:42:22
           name: behavior.metadata?.name || 'Unknown Zone',
           motionDetected: status.motionDetected || false,
           enabled: behavior.enabled && status.enabled,
-          reachable: status.motionValid !== false,
+          reachable: false,
           lastChanged: status.lastChanged
         };
killedBy: MotionService parseMotionSensors should parse MotionAware zones correctly
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
services/motionService.js:46:13
           lastChanged: status.lastChanged
         };
       })
-      .sort((a, b) => a.name.localeCompare(b.name)); // Sort alphabetically
+      .sort(() => undefined); // Sort alphabetically
 
     return motionZones;
killedBy: MotionService parseMotionSensors should sort zones alphabetically by name
statusReason: expected 'Zzz Garage' to be 'Aaa Entrance' // Object.is equality

[NoCoverage] BlockStatement
services/motionService.js:57:44
    * @param {string} username - Hue username
    * @returns {Object} Object with zones array
    */
-  async getMotionZones(bridgeIp, username) {
-    try {
-      // Fetch both endpoints in parallel
-      const [behaviorsData, motionAreasData] = await Promise.all([
-        hueClient.getResource(bridgeIp, username, 'behavior_instance'),
-        hueClient.getResource(bridgeIp, username, 'convenience_area_motion')
-      ]);
-
-      // Parse and combine data
-      const zones = this.parseMotionSensors(behaviorsData, motionAreasData);
-
-      return { zones };
-    } catch (error) {
-      throw new Error(`Failed to get motion zones: ${error.message}`);
-    }
-  }
+  async getMotionZones(bridgeIp, username) {}
 }
 

[NoCoverage] BlockStatement
services/motionService.js:58:9
    * @returns {Object} Object with zones array
    */
   async getMotionZones(bridgeIp, username) {
-    try {
-      // Fetch both endpoints in parallel
-      const [behaviorsData, motionAreasData] = await Promise.all([
-        hueClient.getResource(bridgeIp, username, 'behavior_instance'),
-        hueClient.getResource(bridgeIp, username, 'convenience_area_motion')
-      ]);
-
-      // Parse and combine data
-      const zones = this.parseMotionSensors(behaviorsData, motionAreasData);
-
-      return { zones };
-    } catch (error) {
+    try {} catch (error) {
       throw new Error(`Failed to get motion zones: ${error.message}`);
     }

[NoCoverage] StringLiteral
services/motionService.js:62:51
       // Fetch both endpoints in parallel
       const [behaviorsData, motionAreasData] = await Promise.all([
         hueClient.getResource(bridgeIp, username, 'behavior_instance'),
-        hueClient.getResource(bridgeIp, username, 'convenience_area_motion')
+        hueClient.getResource(bridgeIp, username, "")
       ]);
 

[NoCoverage] BlockStatement
services/motionService.js:69:21
       const zones = this.parseMotionSensors(behaviorsData, motionAreasData);
 
       return { zones };
-    } catch (error) {
-      throw new Error(`Failed to get motion zones: ${error.message}`);
-    }
+    } catch (error) {}
   }
 }
