[Killed] ConditionalExpression
services/roomService.js:14:9
    * @returns {Object} Room map with light assignments
    */
   buildRoomHierarchy(lightsData, roomsData, devicesData) {
-    if (!lightsData?.data || !roomsData?.data || !devicesData?.data) return null;
+    if (false) return null;
 
     // Helper to get light by UUID
killedBy: RoomService buildRoomHierarchy should return null when missing data
statusReason: Cannot read properties of null (reading 'data')

[Killed] BooleanLiteral
services/roomService.js:14:30
    * @returns {Object} Room map with light assignments
    */
   buildRoomHierarchy(lightsData, roomsData, devicesData) {
-    if (!lightsData?.data || !roomsData?.data || !devicesData?.data) return null;
+    if (!lightsData?.data || roomsData?.data || !devicesData?.data) return null;
 
     // Helper to get light by UUID
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
services/roomService.js:17:38
     if (!lightsData?.data || !roomsData?.data || !devicesData?.data) return null;
 
     // Helper to get light by UUID
-    const getLightByUuid = (uuid) => {
-      return lightsData.data.find(light => light.id === uuid);
-    };
+    const getLightByUuid = (uuid) => {};
 
     // Build device → lights map
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
services/roomService.js:18:44
 
     // Helper to get light by UUID
     const getLightByUuid = (uuid) => {
-      return lightsData.data.find(light => light.id === uuid);
+      return lightsData.data.find(light => light.id !== uuid);
     };
 
killedBy: RoomService buildRoomHierarchy should handle direct light references in rooms
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
services/roomService.js:18:44
 
     // Helper to get light by UUID
     const getLightByUuid = (uuid) => {
-      return lightsData.data.find(light => light.id === uuid);
+      return lightsData.data.find(light => false);
     };
 
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
services/roomService.js:23:40
 
     // Build device → lights map
     const deviceToLights = {};
-    devicesData.data.forEach(device => {
-      const lightUuids = device.services
-        ?.filter(s => s.rtype === 'light')
-        .map(s => s.rid) || [];
-      deviceToLights[device.id] = lightUuids;
-    });
+    devicesData.data.forEach(device => {});
 
     const roomMap = {};
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] LogicalOperator
services/roomService.js:24:26
     // Build device → lights map
     const deviceToLights = {};
     devicesData.data.forEach(device => {
-      const lightUuids = device.services
-        ?.filter(s => s.rtype === 'light')
-        .map(s => s.rid) || [];
+      const lightUuids = device.services?.filter(s => s.rtype === 'light').map(s => s.rid) && [];
       deviceToLights[device.id] = lightUuids;
     });
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] ConditionalExpression
services/roomService.js:24:26
     // Build device → lights map
     const deviceToLights = {};
     devicesData.data.forEach(device => {
-      const lightUuids = device.services
-        ?.filter(s => s.rtype === 'light')
-        .map(s => s.rid) || [];
+      const lightUuids = true;
       deviceToLights[device.id] = lightUuids;
     });
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: Spread syntax requires ...iterable[Symbol.iterator] to be a function

[Killed] ArrowFunction
services/roomService.js:25:18
     const deviceToLights = {};
     devicesData.data.forEach(device => {
       const lightUuids = device.services
-        ?.filter(s => s.rtype === 'light')
+        ?.filter(() => undefined)
         .map(s => s.rid) || [];
       deviceToLights[device.id] = lightUuids;
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] ConditionalExpression
services/roomService.js:25:23
     const deviceToLights = {};
     devicesData.data.forEach(device => {
       const lightUuids = device.services
-        ?.filter(s => s.rtype === 'light')
+        ?.filter(s => false)
         .map(s => s.rid) || [];
       deviceToLights[device.id] = lightUuids;
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] ArrowFunction
services/roomService.js:26:14
     devicesData.data.forEach(device => {
       const lightUuids = device.services
         ?.filter(s => s.rtype === 'light')
-        .map(s => s.rid) || [];
+        .map(() => undefined) || [];
       deviceToLights[device.id] = lightUuids;
     });
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected [] to have a length of 2 but got +0

[NoCoverage] ArrayDeclaration
services/roomService.js:26:29
     devicesData.data.forEach(device => {
       const lightUuids = device.services
         ?.filter(s => s.rtype === 'light')
-        .map(s => s.rid) || [];
+        .map(s => s.rid) || ["Stryker was here"];
       deviceToLights[device.id] = lightUuids;
     });

[Killed] BlockStatement
services/roomService.js:33:36
     const roomMap = {};
 
     // Build rooms with their lights
-    roomsData.data.forEach(room => {
-      const lightUuids = [];
-
-      // Get lights from room's devices
-      room.children?.forEach(child => {
-        if (child.rtype === 'device') {
-          const deviceLights = deviceToLights[child.rid] || [];
-          lightUuids.push(...deviceLights);
-        } else if (child.rtype === 'light') {
-          lightUuids.push(child.rid);
-        }
-      });
-
-      if (lightUuids.length > 0) {
-        roomMap[room.metadata?.name || 'Unknown Room'] = {
-          roomUuid: room.id,
-          lightUuids: [...new Set(lightUuids)], // Deduplicate
-          lights: lightUuids
-            .map(uuid => getLightByUuid(uuid))
-            .filter(Boolean)
-        };
-      }
-    });
+    roomsData.data.forEach(room => {});
 
     // Add unassigned lights
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] BlockStatement
services/roomService.js:37:39
       const lightUuids = [];
 
       // Get lights from room's devices
-      room.children?.forEach(child => {
-        if (child.rtype === 'device') {
-          const deviceLights = deviceToLights[child.rid] || [];
-          lightUuids.push(...deviceLights);
-        } else if (child.rtype === 'light') {
-          lightUuids.push(child.rid);
-        }
-      });
+      room.children?.forEach(child => {});
 
       if (lightUuids.length > 0) {
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Survived] OptionalChaining
services/roomService.js:37:7
       const lightUuids = [];
 
       // Get lights from room's devices
-      room.children?.forEach(child => {
+      room.children.forEach(child => {
         if (child.rtype === 'device') {
           const deviceLights = deviceToLights[child.rid] || [];

[Killed] EqualityOperator
services/roomService.js:38:13
 
       // Get lights from room's devices
       room.children?.forEach(child => {
-        if (child.rtype === 'device') {
+        if (child.rtype !== 'device') {
           const deviceLights = deviceToLights[child.rid] || [];
           lightUuids.push(...deviceLights);
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] BlockStatement
services/roomService.js:38:39
 
       // Get lights from room's devices
       room.children?.forEach(child => {
-        if (child.rtype === 'device') {
-          const deviceLights = deviceToLights[child.rid] || [];
-          lightUuids.push(...deviceLights);
-        } else if (child.rtype === 'light') {
+        if (child.rtype === 'device') {} else if (child.rtype === 'light') {
           lightUuids.push(child.rid);
         }
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] ConditionalExpression
services/roomService.js:39:32
       // Get lights from room's devices
       room.children?.forEach(child => {
         if (child.rtype === 'device') {
-          const deviceLights = deviceToLights[child.rid] || [];
+          const deviceLights = false;
           lightUuids.push(...deviceLights);
         } else if (child.rtype === 'light') {
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: Spread syntax requires ...iterable[Symbol.iterator] to be a function

[Killed] LogicalOperator
services/roomService.js:39:32
       // Get lights from room's devices
       room.children?.forEach(child => {
         if (child.rtype === 'device') {
-          const deviceLights = deviceToLights[child.rid] || [];
+          const deviceLights = deviceToLights[child.rid] && [];
           lightUuids.push(...deviceLights);
         } else if (child.rtype === 'light') {
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] ConditionalExpression
services/roomService.js:41:20
         if (child.rtype === 'device') {
           const deviceLights = deviceToLights[child.rid] || [];
           lightUuids.push(...deviceLights);
-        } else if (child.rtype === 'light') {
+        } else if (false) {
           lightUuids.push(child.rid);
         }
killedBy: RoomService buildRoomHierarchy should handle direct light references in rooms
statusReason: Cannot read properties of undefined (reading 'lights')

[Killed] EqualityOperator
services/roomService.js:41:20
         if (child.rtype === 'device') {
           const deviceLights = deviceToLights[child.rid] || [];
           lightUuids.push(...deviceLights);
-        } else if (child.rtype === 'light') {
+        } else if (child.rtype !== 'light') {
           lightUuids.push(child.rid);
         }
killedBy: RoomService buildRoomHierarchy should handle direct light references in rooms
statusReason: Cannot read properties of undefined (reading 'lights')

[Killed] ConditionalExpression
services/roomService.js:46:11
         }
       });
 
-      if (lightUuids.length > 0) {
+      if (true) {
         roomMap[room.metadata?.name || 'Unknown Room'] = {
           roomUuid: room.id,
killedBy: RoomService buildRoomHierarchy should handle rooms with no lights
statusReason: expected { 'Empty Room': { …(3) } } to not have property "Empty Room"

[Killed] BlockStatement
services/roomService.js:46:34
         }
       });
 
-      if (lightUuids.length > 0) {
-        roomMap[room.metadata?.name || 'Unknown Room'] = {
-          roomUuid: room.id,
-          lightUuids: [...new Set(lightUuids)], // Deduplicate
-          lights: lightUuids
-            .map(uuid => getLightByUuid(uuid))
-            .filter(Boolean)
-        };
-      }
+      if (lightUuids.length > 0) {}
     });
 
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { Object (Unassigned) } to have property "Living Room"

[Killed] LogicalOperator
services/roomService.js:47:17
       });
 
       if (lightUuids.length > 0) {
-        roomMap[room.metadata?.name || 'Unknown Room'] = {
+        roomMap[room.metadata?.name && 'Unknown Room'] = {
           roomUuid: room.id,
           lightUuids: [...new Set(lightUuids)], // Deduplicate
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { 'Unknown Room': { …(3) } } to have property "Living Room"

[Killed] ConditionalExpression
services/roomService.js:47:17
       });
 
       if (lightUuids.length > 0) {
-        roomMap[room.metadata?.name || 'Unknown Room'] = {
+        roomMap[false] = {
           roomUuid: room.id,
           lightUuids: [...new Set(lightUuids)], // Deduplicate
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected { false: { roomUuid: 'room-1', …(2) } } to have property "Living Room"

[Killed] MethodExpression
services/roomService.js:50:19
         roomMap[room.metadata?.name || 'Unknown Room'] = {
           roomUuid: room.id,
           lightUuids: [...new Set(lightUuids)], // Deduplicate
-          lights: lightUuids
-            .map(uuid => getLightByUuid(uuid))
-            .filter(Boolean)
+          lights: lightUuids.map(uuid => getLightByUuid(uuid))
         };
       }
killedBy: RoomService buildRoomHierarchy should filter out null lights
statusReason: expected [ { id: 'light-1', …(1) }, undefined ] to have a length of 1 but got 2

[Killed] ArrowFunction
services/roomService.js:51:18
           roomUuid: room.id,
           lightUuids: [...new Set(lightUuids)], // Deduplicate
           lights: lightUuids
-            .map(uuid => getLightByUuid(uuid))
+            .map(() => undefined)
             .filter(Boolean)
         };
killedBy: RoomService buildRoomHierarchy should build room to light mapping via devices
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrowFunction
services/roomService.js:59:38
 
     // Add unassigned lights
     const assignedLightUuids = new Set(
-      Object.values(roomMap).flatMap(r => r.lightUuids)
+      Object.values(roomMap).flatMap(() => undefined)
     );
     const unassignedLights = lightsData.data.filter(
killedBy: RoomService buildRoomHierarchy should create Unassigned room for lights not in any room
statusReason: expected [ { id: 'light-1', …(1) }, …(1) ] to have a length of 1 but got 2

[Killed] MethodExpression
services/roomService.js:61:30
     const assignedLightUuids = new Set(
       Object.values(roomMap).flatMap(r => r.lightUuids)
     );
-    const unassignedLights = lightsData.data.filter(
-      light => !assignedLightUuids.has(light.id)
-    );
+    const unassignedLights = lightsData.data;
 
     if (unassignedLights.length > 0) {
killedBy: RoomService buildRoomHierarchy should create Unassigned room for lights not in any room
statusReason: expected [ { id: 'light-1', …(1) }, …(1) ] to have a length of 1 but got 2

[Killed] ArrowFunction
services/roomService.js:62:7
       Object.values(roomMap).flatMap(r => r.lightUuids)
     );
     const unassignedLights = lightsData.data.filter(
-      light => !assignedLightUuids.has(light.id)
+      () => undefined
     );
 
killedBy: RoomService buildRoomHierarchy should create Unassigned room for lights not in any room
statusReason: expected { Bedroom: { …(3) } } to have property "Unassigned"

[Killed] BooleanLiteral
services/roomService.js:62:16
       Object.values(roomMap).flatMap(r => r.lightUuids)
     );
     const unassignedLights = lightsData.data.filter(
-      light => !assignedLightUuids.has(light.id)
+      light => assignedLightUuids.has(light.id)
     );
 
killedBy: RoomService buildRoomHierarchy should create Unassigned room for lights not in any room
statusReason: expected 'light-1' to be 'light-2' // Object.is equality

[Killed] BlockStatement
services/roomService.js:65:38
       light => !assignedLightUuids.has(light.id)
     );
 
-    if (unassignedLights.length > 0) {
-      roomMap['Unassigned'] = {
-        roomUuid: null,
-        lightUuids: unassignedLights.map(l => l.id),
-        lights: unassignedLights
-      };
-    }
+    if (unassignedLights.length > 0) {}
 
     return roomMap;
killedBy: RoomService buildRoomHierarchy should create Unassigned room for lights not in any room
statusReason: expected { Bedroom: { …(3) } } to have property "Unassigned"

[Killed] ConditionalExpression
services/roomService.js:65:9
       light => !assignedLightUuids.has(light.id)
     );
 
-    if (unassignedLights.length > 0) {
+    if (false) {
       roomMap['Unassigned'] = {
         roomUuid: null,
killedBy: RoomService buildRoomHierarchy should create Unassigned room for lights not in any room
statusReason: expected { Bedroom: { …(3) } } to have property "Unassigned"

[Killed] StringLiteral
services/roomService.js:66:15
     );
 
     if (unassignedLights.length > 0) {
-      roomMap['Unassigned'] = {
+      roomMap[""] = {
         roomUuid: null,
         lightUuids: unassignedLights.map(l => l.id),
killedBy: RoomService buildRoomHierarchy should create Unassigned room for lights not in any room
statusReason: expected { Bedroom: { …(3) }, '': { …(3) } } to have property "Unassigned"

[Survived] ArrowFunction
services/roomService.js:68:42
     if (unassignedLights.length > 0) {
       roomMap['Unassigned'] = {
         roomUuid: null,
-        lightUuids: unassignedLights.map(l => l.id),
+        lightUuids: unassignedLights.map(() => undefined),
         lights: unassignedLights
       };

[Killed] BlockStatement
services/roomService.js:82:42
    * @param {string} roomUuid - Room UUID
    * @returns {Array} Array of scene objects with id and name
    */
-  getScenesForRoom(scenesData, roomUuid) {
-    if (!scenesData?.data) return [];
-
-    return scenesData.data
-      .filter(scene => scene.group?.rid === roomUuid)
-      .map(scene => ({
-        id: scene.id,
-        name: scene.metadata?.name || 'Unknown Scene'
-      }))
-      .sort((a, b) => a.name.localeCompare(b.name));
-  }
+  getScenesForRoom(scenesData, roomUuid) {}
 
   /**
killedBy: RoomService getScenesForRoom should return empty array when no scenes data
statusReason: expected undefined to deeply equal []

[Killed] OptionalChaining
services/roomService.js:83:10
    * @returns {Array} Array of scene objects with id and name
    */
   getScenesForRoom(scenesData, roomUuid) {
-    if (!scenesData?.data) return [];
+    if (!scenesData.data) return [];
 
     return scenesData.data
killedBy: RoomService getScenesForRoom should return empty array when no scenes data
statusReason: Cannot read properties of null (reading 'data')

[Killed] BooleanLiteral
services/roomService.js:83:9
    * @returns {Array} Array of scene objects with id and name
    */
   getScenesForRoom(scenesData, roomUuid) {
-    if (!scenesData?.data) return [];
+    if (scenesData?.data) return [];
 
     return scenesData.data
killedBy: RoomService getScenesForRoom should return empty array when no scenes data
statusReason: Cannot read properties of null (reading 'data')

[Killed] MethodExpression
services/roomService.js:85:12
   getScenesForRoom(scenesData, roomUuid) {
     if (!scenesData?.data) return [];
 
-    return scenesData.data
-      .filter(scene => scene.group?.rid === roomUuid)
+    return scenesData.data
       .map(scene => ({
         id: scene.id,
killedBy: RoomService getScenesForRoom should filter scenes by room UUID
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] MethodExpression
services/roomService.js:85:12
   getScenesForRoom(scenesData, roomUuid) {
     if (!scenesData?.data) return [];
 
-    return scenesData.data
-      .filter(scene => scene.group?.rid === roomUuid)
-      .map(scene => ({
-        id: scene.id,
-        name: scene.metadata?.name || 'Unknown Scene'
-      }))
-      .sort((a, b) => a.name.localeCompare(b.name));
+    return scenesData.data.filter(scene => scene.group?.rid === roomUuid).map(scene => ({
+  id: scene.id,
+  name: scene.metadata?.name || 'Unknown Scene'
+}));
   }
 
killedBy: RoomService getScenesForRoom should sort scenes alphabetically by name
statusReason: expected 'Zzz Sleep' to be 'Aaa Morning' // Object.is equality

[Killed] ArrowFunction
services/roomService.js:86:15
     if (!scenesData?.data) return [];
 
     return scenesData.data
-      .filter(scene => scene.group?.rid === roomUuid)
+      .filter(() => undefined)
       .map(scene => ({
         id: scene.id,
killedBy: RoomService getScenesForRoom should filter scenes by room UUID
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
services/roomService.js:86:24
     if (!scenesData?.data) return [];
 
     return scenesData.data
-      .filter(scene => scene.group?.rid === roomUuid)
+      .filter(scene => scene.group?.rid !== roomUuid)
       .map(scene => ({
         id: scene.id,
killedBy: RoomService getScenesForRoom should filter scenes by room UUID
statusReason: expected [ { id: 'scene-2', name: 'Dim' } ] to have a length of 2 but got 1

[Killed] ArrowFunction
services/roomService.js:87:12
 
     return scenesData.data
       .filter(scene => scene.group?.rid === roomUuid)
-      .map(scene => ({
-        id: scene.id,
-        name: scene.metadata?.name || 'Unknown Scene'
-      }))
+      .map(() => undefined)
       .sort((a, b) => a.name.localeCompare(b.name));
   }
killedBy: RoomService getScenesForRoom should filter scenes by room UUID
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
services/roomService.js:87:22
 
     return scenesData.data
       .filter(scene => scene.group?.rid === roomUuid)
-      .map(scene => ({
-        id: scene.id,
-        name: scene.metadata?.name || 'Unknown Scene'
-      }))
+      .map(scene => ({}))
       .sort((a, b) => a.name.localeCompare(b.name));
   }
killedBy: RoomService getScenesForRoom should filter scenes by room UUID
statusReason: Cannot read properties of undefined (reading 'localeCompare')

[Killed] ConditionalExpression
services/roomService.js:89:15
       .filter(scene => scene.group?.rid === roomUuid)
       .map(scene => ({
         id: scene.id,
-        name: scene.metadata?.name || 'Unknown Scene'
+        name: true
       }))
       .sort((a, b) => a.name.localeCompare(b.name));
killedBy: RoomService getScenesForRoom should filter scenes by room UUID
statusReason: a.name.localeCompare is not a function

[Killed] ConditionalExpression
services/roomService.js:89:15
       .filter(scene => scene.group?.rid === roomUuid)
       .map(scene => ({
         id: scene.id,
-        name: scene.metadata?.name || 'Unknown Scene'
+        name: false
       }))
       .sort((a, b) => a.name.localeCompare(b.name));
killedBy: RoomService getScenesForRoom should filter scenes by room UUID
statusReason: a.name.localeCompare is not a function

[Killed] ArrowFunction
services/roomService.js:91:13
         id: scene.id,
         name: scene.metadata?.name || 'Unknown Scene'
       }))
-      .sort((a, b) => a.name.localeCompare(b.name));
+      .sort(() => undefined);
   }
 
killedBy: RoomService getScenesForRoom should sort scenes alphabetically by name
statusReason: expected 'Zzz Sleep' to be 'Aaa Morning' // Object.is equality

[Killed] BlockStatement
services/roomService.js:99:34
    * @param {Array} roomLights - Array of light objects
    * @returns {Object} Stats object with lightsOnCount, totalLights, averageBrightness
    */
-  calculateRoomStats(roomLights) {
-    if (!roomLights || roomLights.length === 0) {
-      return { lightsOnCount: 0, totalLights: 0, averageBrightness: 0 };
-    }
-
-    const lightsOnCount = roomLights.filter(light => light.on?.on).length;
-    const totalLights = roomLights.length;
-
-    // Calculate average brightness of lights that are on
-    const lightsOn = roomLights.filter(light => light.on?.on);
-    const averageBrightness = lightsOn.length > 0
-      ? lightsOn.reduce((sum, light) => {
-          // Use 50% as default during scene transitions when brightness data is loading
-          const brightness = light.dimming?.brightness ?? 50;
-          return sum + brightness;
-        }, 0) / lightsOn.length
-      : 0;
-
-    return { lightsOnCount, totalLights, averageBrightness };
-  }
+  calculateRoomStats(roomLights) {}
 
   /**
killedBy: RoomService calculateRoomStats should return zeros for empty array
statusReason: expected undefined to deeply equal { lightsOnCount: +0, …(2) }

[Killed] ConditionalExpression
services/roomService.js:100:9
    * @returns {Object} Stats object with lightsOnCount, totalLights, averageBrightness
    */
   calculateRoomStats(roomLights) {
-    if (!roomLights || roomLights.length === 0) {
+    if (false) {
       return { lightsOnCount: 0, totalLights: 0, averageBrightness: 0 };
     }
killedBy: RoomService calculateRoomStats should return zeros for null input
statusReason: Cannot read properties of null (reading 'filter')

[Killed] BooleanLiteral
services/roomService.js:100:9
    * @returns {Object} Stats object with lightsOnCount, totalLights, averageBrightness
    */
   calculateRoomStats(roomLights) {
-    if (!roomLights || roomLights.length === 0) {
+    if (roomLights || roomLights.length === 0) {
       return { lightsOnCount: 0, totalLights: 0, averageBrightness: 0 };
     }
killedBy: RoomService calculateRoomStats should return zeros for null input
statusReason: Cannot read properties of null (reading 'length')

[Killed] ArrowFunction
services/roomService.js:104:45
       return { lightsOnCount: 0, totalLights: 0, averageBrightness: 0 };
     }
 
-    const lightsOnCount = roomLights.filter(light => light.on?.on).length;
+    const lightsOnCount = roomLights.filter(() => undefined).length;
     const totalLights = roomLights.length;
 
killedBy: RoomService calculateRoomStats should count lights correctly
statusReason: expected +0 to be 2 // Object.is equality

[Killed] OptionalChaining
services/roomService.js:104:54
       return { lightsOnCount: 0, totalLights: 0, averageBrightness: 0 };
     }
 
-    const lightsOnCount = roomLights.filter(light => light.on?.on).length;
+    const lightsOnCount = roomLights.filter(light => light.on.on).length;
     const totalLights = roomLights.length;
 
killedBy: RoomService calculateRoomStats should handle lights with undefined on state
statusReason: Cannot read properties of undefined (reading 'on')

[Killed] MethodExpression
services/roomService.js:108:22
     const totalLights = roomLights.length;
 
     // Calculate average brightness of lights that are on
-    const lightsOn = roomLights.filter(light => light.on?.on);
+    const lightsOn = roomLights;
     const averageBrightness = lightsOn.length > 0
       ? lightsOn.reduce((sum, light) => {
killedBy: RoomService calculateRoomStats should return 0 average brightness when all lights are off
statusReason: expected 75 to be +0 // Object.is equality

[Killed] ArrowFunction
services/roomService.js:108:40
     const totalLights = roomLights.length;
 
     // Calculate average brightness of lights that are on
-    const lightsOn = roomLights.filter(light => light.on?.on);
+    const lightsOn = roomLights.filter(() => undefined);
     const averageBrightness = lightsOn.length > 0
       ? lightsOn.reduce((sum, light) => {
killedBy: RoomService calculateRoomStats should calculate average brightness of lights that are on
statusReason: expected +0 to be 75 // Object.is equality

[Killed] EqualityOperator
services/roomService.js:109:31
 
     // Calculate average brightness of lights that are on
     const lightsOn = roomLights.filter(light => light.on?.on);
-    const averageBrightness = lightsOn.length > 0
+    const averageBrightness = lightsOn.length <= 0
       ? lightsOn.reduce((sum, light) => {
           // Use 50% as default during scene transitions when brightness data is loading
killedBy: RoomService calculateRoomStats should calculate average brightness of lights that are on
statusReason: expected +0 to be 75 // Object.is equality

[Killed] ConditionalExpression
services/roomService.js:109:31
 
     // Calculate average brightness of lights that are on
     const lightsOn = roomLights.filter(light => light.on?.on);
-    const averageBrightness = lightsOn.length > 0
+    const averageBrightness = true
       ? lightsOn.reduce((sum, light) => {
           // Use 50% as default during scene transitions when brightness data is loading
killedBy: RoomService calculateRoomStats should return 0 average brightness when all lights are off
statusReason: expected NaN to be +0 // Object.is equality

[Killed] BlockStatement
services/roomService.js:110:41
     // Calculate average brightness of lights that are on
     const lightsOn = roomLights.filter(light => light.on?.on);
     const averageBrightness = lightsOn.length > 0
-      ? lightsOn.reduce((sum, light) => {
-          // Use 50% as default during scene transitions when brightness data is loading
-          const brightness = light.dimming?.brightness ?? 50;
-          return sum + brightness;
-        }, 0) / lightsOn.length
+      ? lightsOn.reduce((sum, light) => {}, 0) / lightsOn.length
       : 0;
 
killedBy: RoomService calculateRoomStats should calculate average brightness of lights that are on
statusReason: expected NaN to be 75 // Object.is equality
