[Killed] ArithmeticOperator
services/roomService.js:110:9
     // Calculate average brightness of lights that are on
     const lightsOn = roomLights.filter(light => light.on?.on);
     const averageBrightness = lightsOn.length > 0
-      ? lightsOn.reduce((sum, light) => {
-          // Use 50% as default during scene transitions when brightness data is loading
-          const brightness = light.dimming?.brightness ?? 50;
-          return sum + brightness;
-        }, 0) / lightsOn.length
+      ? lightsOn.reduce((sum, light) => {
+  // Use 50% as default during scene transitions when brightness data is loading
+  const brightness = light.dimming?.brightness ?? 50;
+  return sum + brightness;
+}, 0) * lightsOn.length
       : 0;
 
killedBy: RoomService calculateRoomStats should calculate average brightness of lights that are on
statusReason: expected 300 to be 75 // Object.is equality

[Killed] LogicalOperator
services/roomService.js:112:30
     const averageBrightness = lightsOn.length > 0
       ? lightsOn.reduce((sum, light) => {
           // Use 50% as default during scene transitions when brightness data is loading
-          const brightness = light.dimming?.brightness ?? 50;
+          const brightness = light.dimming?.brightness && 50;
           return sum + brightness;
         }, 0) / lightsOn.length
killedBy: RoomService calculateRoomStats should calculate average brightness of lights that are on
statusReason: expected 50 to be 75 // Object.is equality

[Killed] OptionalChaining
services/roomService.js:112:30
     const averageBrightness = lightsOn.length > 0
       ? lightsOn.reduce((sum, light) => {
           // Use 50% as default during scene transitions when brightness data is loading
-          const brightness = light.dimming?.brightness ?? 50;
+          const brightness = light.dimming.brightness ?? 50;
           return sum + brightness;
         }, 0) / lightsOn.length
killedBy: RoomService calculateRoomStats should handle missing dimming data with 50% default
statusReason: Cannot read properties of undefined (reading 'brightness')

[Killed] ArithmeticOperator
services/roomService.js:113:18
       ? lightsOn.reduce((sum, light) => {
           // Use 50% as default during scene transitions when brightness data is loading
           const brightness = light.dimming?.brightness ?? 50;
-          return sum + brightness;
+          return sum - brightness;
         }, 0) / lightsOn.length
       : 0;
killedBy: RoomService calculateRoomStats should calculate average brightness of lights that are on
statusReason: expected -75 to be 75 // Object.is equality

[NoCoverage] BlockStatement
services/roomService.js:126:45
    * @param {Object} roomMap - Room map from buildRoomHierarchy
    * @returns {Array} Array of unassigned lights
    */
-  findUnassignedLights(lightsData, roomMap) {
-    if (!lightsData?.data || !roomMap) return [];
-
-    const assignedLightUuids = new Set(
-      Object.values(roomMap)
-        .filter(room => room.roomUuid !== null) // Exclude already-created Unassigned room
-        .flatMap(r => r.lightUuids)
-    );
-
-    return lightsData.data.filter(light => !assignedLightUuids.has(light.id));
-  }
+  findUnassignedLights(lightsData, roomMap) {}
 }
 

[NoCoverage] BooleanLiteral
services/roomService.js:127:30
    * @returns {Array} Array of unassigned lights
    */
   findUnassignedLights(lightsData, roomMap) {
-    if (!lightsData?.data || !roomMap) return [];
+    if (!lightsData?.data || roomMap) return [];
 
     const assignedLightUuids = new Set(

[NoCoverage] ConditionalExpression
services/roomService.js:127:9
    * @returns {Array} Array of unassigned lights
    */
   findUnassignedLights(lightsData, roomMap) {
-    if (!lightsData?.data || !roomMap) return [];
+    if (true) return [];
 
     const assignedLightUuids = new Set(

[NoCoverage] MethodExpression
services/roomService.js:130:7
     if (!lightsData?.data || !roomMap) return [];
 
     const assignedLightUuids = new Set(
-      Object.values(roomMap)
-        .filter(room => room.roomUuid !== null) // Exclude already-created Unassigned room
+      Object.values(roomMap) // Exclude already-created Unassigned room
         .flatMap(r => r.lightUuids)
     );

[NoCoverage] ArrowFunction
services/roomService.js:131:17
 
     const assignedLightUuids = new Set(
       Object.values(roomMap)
-        .filter(room => room.roomUuid !== null) // Exclude already-created Unassigned room
+        .filter(() => undefined) // Exclude already-created Unassigned room
         .flatMap(r => r.lightUuids)
     );

[NoCoverage] ConditionalExpression
services/roomService.js:131:25
 
     const assignedLightUuids = new Set(
       Object.values(roomMap)
-        .filter(room => room.roomUuid !== null) // Exclude already-created Unassigned room
+        .filter(room => true) // Exclude already-created Unassigned room
         .flatMap(r => r.lightUuids)
     );

[NoCoverage] ArrowFunction
services/roomService.js:132:18
     const assignedLightUuids = new Set(
       Object.values(roomMap)
         .filter(room => room.roomUuid !== null) // Exclude already-created Unassigned room
-        .flatMap(r => r.lightUuids)
+        .flatMap(() => undefined)
     );
 

[NoCoverage] ArrowFunction
services/roomService.js:135:35
         .flatMap(r => r.lightUuids)
     );
 
-    return lightsData.data.filter(light => !assignedLightUuids.has(light.id));
+    return lightsData.data.filter(() => undefined);
   }
 }

[NoCoverage] MethodExpression
services/roomService.js:135:12
         .flatMap(r => r.lightUuids)
     );
 
-    return lightsData.data.filter(light => !assignedLightUuids.has(light.id));
+    return lightsData.data;
   }
 }
