[NoCoverage] BlockStatement
services/sessionManager.js:8:17
  * Stores bridge connection info server-side and issues session tokens
  */
 class SessionManager {
-  constructor() {
-    // In-memory session storage: { sessionToken → { bridgeIp, username, createdAt, lastUsed } }
-    this.sessions = new Map();
-
-    // Session configuration
-    this.SESSION_EXPIRY = 24 * 60 * 60 * 1000; // 24 hours
-    this.CLEANUP_INTERVAL = 60 * 60 * 1000; // Clean up every hour
-
-    // Start cleanup interval
-    this.startCleanup();
-  }
+  constructor() {}
 
   /**

[NoCoverage] ArithmeticOperator
services/sessionManager.js:13:27
     this.sessions = new Map();
 
     // Session configuration
-    this.SESSION_EXPIRY = 24 * 60 * 60 * 1000; // 24 hours
+    this.SESSION_EXPIRY = 24 * 60 * 60 / 1000; // 24 hours
     this.CLEANUP_INTERVAL = 60 * 60 * 1000; // Clean up every hour
 

[NoCoverage] ArithmeticOperator
services/sessionManager.js:13:27
     this.sessions = new Map();
 
     // Session configuration
-    this.SESSION_EXPIRY = 24 * 60 * 60 * 1000; // 24 hours
+    this.SESSION_EXPIRY = 24 / 60 * 60 * 1000; // 24 hours
     this.CLEANUP_INTERVAL = 60 * 60 * 1000; // Clean up every hour
 

[NoCoverage] ArithmeticOperator
services/sessionManager.js:14:29
 
     // Session configuration
     this.SESSION_EXPIRY = 24 * 60 * 60 * 1000; // 24 hours
-    this.CLEANUP_INTERVAL = 60 * 60 * 1000; // Clean up every hour
+    this.CLEANUP_INTERVAL = 60 / 60 * 1000; // Clean up every hour
 
     // Start cleanup interval

[NoCoverage] ArithmeticOperator
services/sessionManager.js:14:29
 
     // Session configuration
     this.SESSION_EXPIRY = 24 * 60 * 60 * 1000; // 24 hours
-    this.CLEANUP_INTERVAL = 60 * 60 * 1000; // Clean up every hour
+    this.CLEANUP_INTERVAL = 60 * 60 / 1000; // Clean up every hour
 
     // Start cleanup interval

[NoCoverage] BlockStatement
services/sessionManager.js:26:37
    * @param {string} username - Hue username/API key
    * @returns {Object} Session info with token
    */
-  createSession(bridgeIp, username) {
-    // Generate secure random token
-    const sessionToken = this._generateToken();
-
-    // Store session
-    this.sessions.set(sessionToken, {
-      bridgeIp,
-      username,
-      createdAt: Date.now(),
-      lastUsed: Date.now()
-    });
-
-    console.log(`[SESSION] Created session ${sessionToken.substring(0, 8)}... for bridge ${bridgeIp}`);
-
-    return {
-      sessionToken,
-      expiresIn: this.SESSION_EXPIRY / 1000, // seconds
-      bridgeIp
-    };
-  }
+  createSession(bridgeIp, username) {}
 
   /**

[NoCoverage] ObjectLiteral
services/sessionManager.js:31:37
     const sessionToken = this._generateToken();
 
     // Store session
-    this.sessions.set(sessionToken, {
-      bridgeIp,
-      username,
-      createdAt: Date.now(),
-      lastUsed: Date.now()
-    });
+    this.sessions.set(sessionToken, {});
 
     console.log(`[SESSION] Created session ${sessionToken.substring(0, 8)}... for bridge ${bridgeIp}`);

[NoCoverage] MethodExpression
services/sessionManager.js:38:46
       lastUsed: Date.now()
     });
 
-    console.log(`[SESSION] Created session ${sessionToken.substring(0, 8)}... for bridge ${bridgeIp}`);
+    console.log(`[SESSION] Created session ${sessionToken}... for bridge ${bridgeIp}`);
 
     return {

[NoCoverage] StringLiteral
services/sessionManager.js:38:17
       lastUsed: Date.now()
     });
 
-    console.log(`[SESSION] Created session ${sessionToken.substring(0, 8)}... for bridge ${bridgeIp}`);
+    console.log(``);
 
     return {

[NoCoverage] ArithmeticOperator
services/sessionManager.js:42:18
 
     return {
       sessionToken,
-      expiresIn: this.SESSION_EXPIRY / 1000, // seconds
+      expiresIn: this.SESSION_EXPIRY * 1000, // seconds
       bridgeIp
     };

[NoCoverage] BlockStatement
services/sessionManager.js:52:28
    * @param {string} sessionToken - Session token
    * @returns {Object|null} Session data or null if not found/expired
    */
-  getSession(sessionToken) {
-    const session = this.sessions.get(sessionToken);
-
-    if (!session) {
-      return null;
-    }
-
-    // Check if expired
-    const age = Date.now() - session.createdAt;
-    if (age > this.SESSION_EXPIRY) {
-      this.sessions.delete(sessionToken);
-      console.log(`[SESSION] Expired session ${sessionToken.substring(0, 8)}...`);
-      return null;
-    }
-
-    // Update last used
-    session.lastUsed = Date.now();
-
-    return {
-      bridgeIp: session.bridgeIp,
-      username: session.username
-    };
-  }
+  getSession(sessionToken) {}
 
   /**

[NoCoverage] ConditionalExpression
services/sessionManager.js:55:9
   getSession(sessionToken) {
     const session = this.sessions.get(sessionToken);
 
-    if (!session) {
+    if (false) {
       return null;
     }

[NoCoverage] ConditionalExpression
services/sessionManager.js:55:9
   getSession(sessionToken) {
     const session = this.sessions.get(sessionToken);
 
-    if (!session) {
+    if (true) {
       return null;
     }

[NoCoverage] ArithmeticOperator
services/sessionManager.js:60:17
     }
 
     // Check if expired
-    const age = Date.now() - session.createdAt;
+    const age = Date.now() + session.createdAt;
     if (age > this.SESSION_EXPIRY) {
       this.sessions.delete(sessionToken);

[NoCoverage] BlockStatement
services/sessionManager.js:61:36
 
     // Check if expired
     const age = Date.now() - session.createdAt;
-    if (age > this.SESSION_EXPIRY) {
-      this.sessions.delete(sessionToken);
-      console.log(`[SESSION] Expired session ${sessionToken.substring(0, 8)}...`);
-      return null;
-    }
+    if (age > this.SESSION_EXPIRY) {}
 
     // Update last used

[NoCoverage] ConditionalExpression
services/sessionManager.js:61:9
 
     // Check if expired
     const age = Date.now() - session.createdAt;
-    if (age > this.SESSION_EXPIRY) {
+    if (false) {
       this.sessions.delete(sessionToken);
       console.log(`[SESSION] Expired session ${sessionToken.substring(0, 8)}...`);

[NoCoverage] MethodExpression
services/sessionManager.js:63:48
     const age = Date.now() - session.createdAt;
     if (age > this.SESSION_EXPIRY) {
       this.sessions.delete(sessionToken);
-      console.log(`[SESSION] Expired session ${sessionToken.substring(0, 8)}...`);
+      console.log(`[SESSION] Expired session ${sessionToken}...`);
       return null;
     }

[NoCoverage] StringLiteral
services/sessionManager.js:63:19
     const age = Date.now() - session.createdAt;
     if (age > this.SESSION_EXPIRY) {
       this.sessions.delete(sessionToken);
-      console.log(`[SESSION] Expired session ${sessionToken.substring(0, 8)}...`);
+      console.log(``);
       return null;
     }

[NoCoverage] ObjectLiteral
services/sessionManager.js:70:12
     // Update last used
     session.lastUsed = Date.now();
 
-    return {
-      bridgeIp: session.bridgeIp,
-      username: session.username
-    };
+    return {};
   }
 

[NoCoverage] BlockStatement
services/sessionManager.js:81:31
    * @param {string} sessionToken - Session token to revoke
    * @returns {boolean} True if session was found and revoked
    */
-  revokeSession(sessionToken) {
-    const existed = this.sessions.has(sessionToken);
-    this.sessions.delete(sessionToken);
-
-    if (existed) {
-      console.log(`[SESSION] Revoked session ${sessionToken.substring(0, 8)}...`);
-    }
-
-    return existed;
-  }
+  revokeSession(sessionToken) {}
 
   /**

[NoCoverage] ConditionalExpression
services/sessionManager.js:85:9
     const existed = this.sessions.has(sessionToken);
     this.sessions.delete(sessionToken);
 
-    if (existed) {
+    if (true) {
       console.log(`[SESSION] Revoked session ${sessionToken.substring(0, 8)}...`);
     }

[NoCoverage] ConditionalExpression
services/sessionManager.js:85:9
     const existed = this.sessions.has(sessionToken);
     this.sessions.delete(sessionToken);
 
-    if (existed) {
+    if (false) {
       console.log(`[SESSION] Revoked session ${sessionToken.substring(0, 8)}...`);
     }

[NoCoverage] MethodExpression
services/sessionManager.js:86:48
     this.sessions.delete(sessionToken);
 
     if (existed) {
-      console.log(`[SESSION] Revoked session ${sessionToken.substring(0, 8)}...`);
+      console.log(`[SESSION] Revoked session ${sessionToken}...`);
     }
 

[NoCoverage] BlockStatement
services/sessionManager.js:95:14
   /**
    * Get session stats (for monitoring)
    */
-  getStats() {
-    return {
-      activeSessions: this.sessions.size,
-      oldestSession: this._getOldestSessionAge(),
-      newestSession: this._getNewestSessionAge()
-    };
-  }
+  getStats() {}
 
   /**

[NoCoverage] BlockStatement
services/sessionManager.js:106:13
   /**
    * Clean up expired sessions
    */
-  cleanup() {
-    const now = Date.now();
-    let cleaned = 0;
-
-    for (const [token, session] of this.sessions.entries()) {
-      const age = now - session.createdAt;
-      if (age > this.SESSION_EXPIRY) {
-        this.sessions.delete(token);
-        cleaned++;
-      }
-    }
-
-    if (cleaned > 0) {
-      console.log(`[SESSION] Cleaned up ${cleaned} expired session(s)`);
-    }
-
-    return cleaned;
-  }
+  cleanup() {}
 
   /**

[NoCoverage] BlockStatement
services/sessionManager.js:110:61
     const now = Date.now();
     let cleaned = 0;
 
-    for (const [token, session] of this.sessions.entries()) {
-      const age = now - session.createdAt;
-      if (age > this.SESSION_EXPIRY) {
-        this.sessions.delete(token);
-        cleaned++;
-      }
-    }
+    for (const [token, session] of this.sessions.entries()) {}
 
     if (cleaned > 0) {

[NoCoverage] ArithmeticOperator
services/sessionManager.js:111:19
     let cleaned = 0;
 
     for (const [token, session] of this.sessions.entries()) {
-      const age = now - session.createdAt;
+      const age = now + session.createdAt;
       if (age > this.SESSION_EXPIRY) {
         this.sessions.delete(token);

[NoCoverage] ConditionalExpression
services/sessionManager.js:112:11
 
     for (const [token, session] of this.sessions.entries()) {
       const age = now - session.createdAt;
-      if (age > this.SESSION_EXPIRY) {
+      if (false) {
         this.sessions.delete(token);
         cleaned++;

[NoCoverage] EqualityOperator
services/sessionManager.js:112:11
 
     for (const [token, session] of this.sessions.entries()) {
       const age = now - session.createdAt;
-      if (age > this.SESSION_EXPIRY) {
+      if (age >= this.SESSION_EXPIRY) {
         this.sessions.delete(token);
         cleaned++;

[NoCoverage] UpdateOperator
services/sessionManager.js:114:9
       const age = now - session.createdAt;
       if (age > this.SESSION_EXPIRY) {
         this.sessions.delete(token);
-        cleaned++;
+        cleaned--;
       }
     }

[NoCoverage] EqualityOperator
services/sessionManager.js:118:9
       }
     }
 
-    if (cleaned > 0) {
+    if (cleaned >= 0) {
       console.log(`[SESSION] Cleaned up ${cleaned} expired session(s)`);
     }

[NoCoverage] ConditionalExpression
services/sessionManager.js:118:9
       }
     }
 
-    if (cleaned > 0) {
+    if (false) {
       console.log(`[SESSION] Cleaned up ${cleaned} expired session(s)`);
     }

[NoCoverage] StringLiteral
services/sessionManager.js:119:19
     }
 
     if (cleaned > 0) {
-      console.log(`[SESSION] Cleaned up ${cleaned} expired session(s)`);
+      console.log(``);
     }
 

[NoCoverage] BlockStatement
services/sessionManager.js:128:18
   /**
    * Start automatic cleanup interval
    */
-  startCleanup() {
-    this.cleanupInterval = setInterval(() => {
-      this.cleanup();
-    }, this.CLEANUP_INTERVAL);
-
-    console.log('[SESSION] Started automatic session cleanup');
-  }
+  startCleanup() {}
 
   /**

[NoCoverage] BlockStatement
services/sessionManager.js:129:46
    * Start automatic cleanup interval
    */
   startCleanup() {
-    this.cleanupInterval = setInterval(() => {
-      this.cleanup();
-    }, this.CLEANUP_INTERVAL);
+    this.cleanupInterval = setInterval(() => {}, this.CLEANUP_INTERVAL);
 
     console.log('[SESSION] Started automatic session cleanup');

[NoCoverage] BlockStatement
services/sessionManager.js:139:17
   /**
    * Stop automatic cleanup (for testing/shutdown)
    */
-  stopCleanup() {
-    if (this.cleanupInterval) {
-      clearInterval(this.cleanupInterval);
-      this.cleanupInterval = null;
-      console.log('[SESSION] Stopped automatic session cleanup');
-    }
-  }
+  stopCleanup() {}
 
   /**

[NoCoverage] BlockStatement
services/sessionManager.js:140:31
    * Stop automatic cleanup (for testing/shutdown)
    */
   stopCleanup() {
-    if (this.cleanupInterval) {
-      clearInterval(this.cleanupInterval);
-      this.cleanupInterval = null;
-      console.log('[SESSION] Stopped automatic session cleanup');
-    }
+    if (this.cleanupInterval) {}
   }
 

[NoCoverage] ConditionalExpression
services/sessionManager.js:140:9
    * Stop automatic cleanup (for testing/shutdown)
    */
   stopCleanup() {
-    if (this.cleanupInterval) {
+    if (true) {
       clearInterval(this.cleanupInterval);
       this.cleanupInterval = null;

[NoCoverage] StringLiteral
services/sessionManager.js:143:19
     if (this.cleanupInterval) {
       clearInterval(this.cleanupInterval);
       this.cleanupInterval = null;
-      console.log('[SESSION] Stopped automatic session cleanup');
+      console.log("");
     }
   }

[NoCoverage] BlockStatement
services/sessionManager.js:151:20
    * Generate a cryptographically secure random token
    * @private
    */
-  _generateToken() {
-    // Generate 32 bytes of random data and encode as hex
-    // Format: hue_sess_<64 hex characters>
-    const randomBytes = crypto.randomBytes(32);
-    return `hue_sess_${randomBytes.toString('hex')}`;
-  }
+  _generateToken() {}
 
   /**

[NoCoverage] StringLiteral
services/sessionManager.js:155:12
     // Generate 32 bytes of random data and encode as hex
     // Format: hue_sess_<64 hex characters>
     const randomBytes = crypto.randomBytes(32);
-    return `hue_sess_${randomBytes.toString('hex')}`;
+    return ``;
   }
 

[NoCoverage] BlockStatement
services/sessionManager.js:162:26
    * Get age of oldest session in milliseconds
    * @private
    */
-  _getOldestSessionAge() {
-    if (this.sessions.size === 0) return 0;
-
-    const now = Date.now();
-    let oldest = 0;
-
-    for (const session of this.sessions.values()) {
-      const age = now - session.createdAt;
-      if (age > oldest) oldest = age;
-    }
-
-    return oldest;
-  }
+  _getOldestSessionAge() {}
 
   /**

[NoCoverage] EqualityOperator
services/sessionManager.js:163:9
    * @private
    */
   _getOldestSessionAge() {
-    if (this.sessions.size === 0) return 0;
+    if (this.sessions.size !== 0) return 0;
 
     const now = Date.now();

[NoCoverage] ConditionalExpression
services/sessionManager.js:163:9
    * @private
    */
   _getOldestSessionAge() {
-    if (this.sessions.size === 0) return 0;
+    if (false) return 0;
 
     const now = Date.now();

[NoCoverage] BlockStatement
services/sessionManager.js:168:51
     const now = Date.now();
     let oldest = 0;
 
-    for (const session of this.sessions.values()) {
-      const age = now - session.createdAt;
-      if (age > oldest) oldest = age;
-    }
+    for (const session of this.sessions.values()) {}
 
     return oldest;

[NoCoverage] ArithmeticOperator
services/sessionManager.js:169:19
     let oldest = 0;
 
     for (const session of this.sessions.values()) {
-      const age = now - session.createdAt;
+      const age = now + session.createdAt;
       if (age > oldest) oldest = age;
     }

[NoCoverage] EqualityOperator
services/sessionManager.js:170:11
 
     for (const session of this.sessions.values()) {
       const age = now - session.createdAt;
-      if (age > oldest) oldest = age;
+      if (age <= oldest) oldest = age;
     }
 

[NoCoverage] EqualityOperator
services/sessionManager.js:170:11
 
     for (const session of this.sessions.values()) {
       const age = now - session.createdAt;
-      if (age > oldest) oldest = age;
+      if (age >= oldest) oldest = age;
     }
 

[NoCoverage] BlockStatement
services/sessionManager.js:180:26
    * Get age of newest session in milliseconds
    * @private
    */
-  _getNewestSessionAge() {
-    if (this.sessions.size === 0) return 0;
-
-    const now = Date.now();
-    let newest = Infinity;
-
-    for (const session of this.sessions.values()) {
-      const age = now - session.createdAt;
-      if (age < newest) newest = age;
-    }
-
-    return newest;
-  }
+  _getNewestSessionAge() {}
 }
 

[NoCoverage] EqualityOperator
services/sessionManager.js:181:9
    * @private
    */
   _getNewestSessionAge() {
-    if (this.sessions.size === 0) return 0;
+    if (this.sessions.size !== 0) return 0;
 
     const now = Date.now();

[NoCoverage] ConditionalExpression
services/sessionManager.js:181:9
    * @private
    */
   _getNewestSessionAge() {
-    if (this.sessions.size === 0) return 0;
+    if (false) return 0;
 
     const now = Date.now();

[NoCoverage] BlockStatement
services/sessionManager.js:186:51
     const now = Date.now();
     let newest = Infinity;
 
-    for (const session of this.sessions.values()) {
-      const age = now - session.createdAt;
-      if (age < newest) newest = age;
-    }
+    for (const session of this.sessions.values()) {}
 
     return newest;

[NoCoverage] EqualityOperator
services/sessionManager.js:188:11
 
     for (const session of this.sessions.values()) {
       const age = now - session.createdAt;
-      if (age < newest) newest = age;
+      if (age <= newest) newest = age;
     }
 

[NoCoverage] ConditionalExpression
services/sessionManager.js:188:11
 
     for (const session of this.sessions.values()) {
       const age = now - session.createdAt;
-      if (age < newest) newest = age;
+      if (false) newest = age;
     }
 
