[Killed] ObjectLiteral
utils/colorConversion.js:1:22
-const COLOR_CONFIG = {
-  WARM_DIM: { r: 255, g: 200, b: 130 },
-  DEFAULT_WHITE: { r: 255, g: 245, b: 235 },
-  DIM_THRESHOLD: {
-    START: 15,
-    BRIGHT_START: 50
-  },
-  SHADOW_THRESHOLD: 50,
-  XYZ_TO_RGB_MATRIX: {
-    r: [1.656492, -0.354851, -0.255038],
-    g: [-0.707196, 1.655397, 0.036152],
-    b: [0.051713, -0.121364, 1.011530]
-  }
-};
+const COLOR_CONFIG = {};
 
 /**
killedBy: colorConversion xyToRgb should convert xy coordinates to RGB with default brightness
statusReason: Cannot read properties of undefined (reading 'r')

[Killed] ObjectLiteral
utils/colorConversion.js:4:18
 const COLOR_CONFIG = {
   WARM_DIM: { r: 255, g: 200, b: 130 },
   DEFAULT_WHITE: { r: 255, g: 245, b: 235 },
-  DIM_THRESHOLD: {
-    START: 15,
-    BRIGHT_START: 50
-  },
+  DIM_THRESHOLD: {},
   SHADOW_THRESHOLD: 50,
   XYZ_TO_RGB_MATRIX: {
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected 'rgb(NaN, NaN, NaN)' to match /^rgb\(\d+, \d+, \d+\)$/

[Killed] ObjectLiteral
utils/colorConversion.js:9:22
     BRIGHT_START: 50
   },
   SHADOW_THRESHOLD: 50,
-  XYZ_TO_RGB_MATRIX: {
-    r: [1.656492, -0.354851, -0.255038],
-    g: [-0.707196, 1.655397, 0.036152],
-    b: [0.051713, -0.121364, 1.011530]
-  }
+  XYZ_TO_RGB_MATRIX: {}
 };
 
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: Cannot read properties of undefined (reading '0')

[Survived] UnaryOperator
utils/colorConversion.js:10:30
   },
   SHADOW_THRESHOLD: 50,
   XYZ_TO_RGB_MATRIX: {
-    r: [1.656492, -0.354851, -0.255038],
+    r: [1.656492, -0.354851, +0.255038],
     g: [-0.707196, 1.655397, 0.036152],
     b: [0.051713, -0.121364, 1.011530]

[Survived] UnaryOperator
utils/colorConversion.js:10:19
   },
   SHADOW_THRESHOLD: 50,
   XYZ_TO_RGB_MATRIX: {
-    r: [1.656492, -0.354851, -0.255038],
+    r: [1.656492, +0.354851, -0.255038],
     g: [-0.707196, 1.655397, 0.036152],
     b: [0.051713, -0.121364, 1.011530]

[Survived] UnaryOperator
utils/colorConversion.js:11:9
   SHADOW_THRESHOLD: 50,
   XYZ_TO_RGB_MATRIX: {
     r: [1.656492, -0.354851, -0.255038],
-    g: [-0.707196, 1.655397, 0.036152],
+    g: [+0.707196, 1.655397, 0.036152],
     b: [0.051713, -0.121364, 1.011530]
   }

[Survived] UnaryOperator
utils/colorConversion.js:12:19
   XYZ_TO_RGB_MATRIX: {
     r: [1.656492, -0.354851, -0.255038],
     g: [-0.707196, 1.655397, 0.036152],
-    b: [0.051713, -0.121364, 1.011530]
+    b: [0.051713, +0.121364, 1.011530]
   }
 };

[Killed] ArithmeticOperator
utils/colorConversion.js:25:13
  */
 export const xyToRgb = (x, y, brightness = 100) => {
   // Convert xy to XYZ with brightness scaling
-  const z = 1.0 - x - y;
+  const z = 1.0 + x - y;
   const brightnessScale = Math.pow(brightness / 100, 2.2); // Gamma curve
   const Y = brightnessScale;
killedBy: colorConversion xyToRgb should convert red color correctly
statusReason: expected 187 to be greater than 255

[Survived] ArithmeticOperator
utils/colorConversion.js:25:13
  */
 export const xyToRgb = (x, y, brightness = 100) => {
   // Convert xy to XYZ with brightness scaling
-  const z = 1.0 - x - y;
+  const z = 1.0 - x + y;
   const brightnessScale = Math.pow(brightness / 100, 2.2); // Gamma curve
   const Y = brightnessScale;

[Killed] ArithmeticOperator
utils/colorConversion.js:26:36
 export const xyToRgb = (x, y, brightness = 100) => {
   // Convert xy to XYZ with brightness scaling
   const z = 1.0 - x - y;
-  const brightnessScale = Math.pow(brightness / 100, 2.2); // Gamma curve
+  const brightnessScale = Math.pow(brightness * 100, 2.2); // Gamma curve
   const Y = brightnessScale;
   const X = (Y / y) * x;
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 246 to be less than 246

[Killed] ArithmeticOperator
utils/colorConversion.js:28:14
   const z = 1.0 - x - y;
   const brightnessScale = Math.pow(brightness / 100, 2.2); // Gamma curve
   const Y = brightnessScale;
-  const X = (Y / y) * x;
+  const X = (Y * y) * x;
   const Z = (Y / y) * z;
 
killedBy: colorConversion xyToRgb should convert red color correctly
statusReason: expected 0 to be greater than 255

[Killed] ArithmeticOperator
utils/colorConversion.js:28:13
   const z = 1.0 - x - y;
   const brightnessScale = Math.pow(brightness / 100, 2.2); // Gamma curve
   const Y = brightnessScale;
-  const X = (Y / y) * x;
+  const X = Y / y / x;
   const Z = (Y / y) * z;
 
killedBy: colorConversion xyToRgb should convert blue color correctly
statusReason: expected 100 to be greater than 255

[Killed] ArithmeticOperator
utils/colorConversion.js:29:13
   const brightnessScale = Math.pow(brightness / 100, 2.2); // Gamma curve
   const Y = brightnessScale;
   const X = (Y / y) * x;
-  const Z = (Y / y) * z;
+  const Z = Y / y / z;
 
   // XYZ to RGB (using sRGB D65)
killedBy: colorConversion xyToRgb should convert red color correctly
statusReason: expected 0 to be greater than 63

[Killed] ArithmeticOperator
utils/colorConversion.js:29:14
   const brightnessScale = Math.pow(brightness / 100, 2.2); // Gamma curve
   const Y = brightnessScale;
   const X = (Y / y) * x;
-  const Z = (Y / y) * z;
+  const Z = (Y * y) * z;
 
   // XYZ to RGB (using sRGB D65)
killedBy: colorConversion xyToRgb should convert blue color correctly
statusReason: expected 41 to be greater than 255

[Killed] ArithmeticOperator
utils/colorConversion.js:33:11
 
   // XYZ to RGB (using sRGB D65)
   const matrix = COLOR_CONFIG.XYZ_TO_RGB_MATRIX;
-  let r = X * matrix.r[0] + Y * matrix.r[1] + Z * matrix.r[2];
+  let r = X / matrix.r[0] + Y * matrix.r[1] + Z * matrix.r[2];
   let g = X * matrix.g[0] + Y * matrix.g[1] + Z * matrix.g[2];
   let b = X * matrix.b[0] + Y * matrix.b[1] + Z * matrix.b[2];
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 0 to be less than 0

[Killed] ArithmeticOperator
utils/colorConversion.js:33:47
 
   // XYZ to RGB (using sRGB D65)
   const matrix = COLOR_CONFIG.XYZ_TO_RGB_MATRIX;
-  let r = X * matrix.r[0] + Y * matrix.r[1] + Z * matrix.r[2];
+  let r = X * matrix.r[0] + Y * matrix.r[1] + Z / matrix.r[2];
   let g = X * matrix.g[0] + Y * matrix.g[1] + Z * matrix.g[2];
   let b = X * matrix.b[0] + Y * matrix.b[1] + Z * matrix.b[2];
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 0 to be less than 0

[Killed] ArithmeticOperator
utils/colorConversion.js:34:11
   // XYZ to RGB (using sRGB D65)
   const matrix = COLOR_CONFIG.XYZ_TO_RGB_MATRIX;
   let r = X * matrix.r[0] + Y * matrix.r[1] + Z * matrix.r[2];
-  let g = X * matrix.g[0] + Y * matrix.g[1] + Z * matrix.g[2];
+  let g = X * matrix.g[0] - Y * matrix.g[1] + Z * matrix.g[2];
   let b = X * matrix.b[0] + Y * matrix.b[1] + Z * matrix.b[2];
 
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 0 to be less than 0

[Killed] ArithmeticOperator
utils/colorConversion.js:34:29
   // XYZ to RGB (using sRGB D65)
   const matrix = COLOR_CONFIG.XYZ_TO_RGB_MATRIX;
   let r = X * matrix.r[0] + Y * matrix.r[1] + Z * matrix.r[2];
-  let g = X * matrix.g[0] + Y * matrix.g[1] + Z * matrix.g[2];
+  let g = X * matrix.g[0] + Y / matrix.g[1] + Z * matrix.g[2];
   let b = X * matrix.b[0] + Y * matrix.b[1] + Z * matrix.b[2];
 
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 0 to be less than 0

[Killed] ArithmeticOperator
utils/colorConversion.js:35:11
   const matrix = COLOR_CONFIG.XYZ_TO_RGB_MATRIX;
   let r = X * matrix.r[0] + Y * matrix.r[1] + Z * matrix.r[2];
   let g = X * matrix.g[0] + Y * matrix.g[1] + Z * matrix.g[2];
-  let b = X * matrix.b[0] + Y * matrix.b[1] + Z * matrix.b[2];
+  let b = X / matrix.b[0] + Y * matrix.b[1] + Z * matrix.b[2];
 
   // Apply gamma correction
killedBy: colorConversion xyToRgb should convert red color correctly
statusReason: expected 86 to be greater than 255

[Killed] ArithmeticOperator
utils/colorConversion.js:35:11
   const matrix = COLOR_CONFIG.XYZ_TO_RGB_MATRIX;
   let r = X * matrix.r[0] + Y * matrix.r[1] + Z * matrix.r[2];
   let g = X * matrix.g[0] + Y * matrix.g[1] + Z * matrix.g[2];
-  let b = X * matrix.b[0] + Y * matrix.b[1] + Z * matrix.b[2];
+  let b = X * matrix.b[0] + Y * matrix.b[1] - Z * matrix.b[2];
 
   // Apply gamma correction
killedBy: colorConversion xyToRgb should convert blue color correctly
statusReason: expected 0 to be greater than 217

[Killed] BlockStatement
utils/colorConversion.js:38:33
   let b = X * matrix.b[0] + Y * matrix.b[1] + Z * matrix.b[2];
 
   // Apply gamma correction
-  const gammaCorrect = (val) => {
-    if (val <= 0.0031308) return 12.92 * val;
-    return 1.055 * Math.pow(val, 1.0 / 2.4) - 0.055;
-  };
+  const gammaCorrect = (val) => {};
 
   r = gammaCorrect(r);
killedBy: colorConversion xyToRgb should convert xy coordinates to RGB with default brightness
statusReason: expected NaN to be greater than or equal to 0

[Killed] EqualityOperator
utils/colorConversion.js:39:9
 
   // Apply gamma correction
   const gammaCorrect = (val) => {
-    if (val <= 0.0031308) return 12.92 * val;
+    if (val > 0.0031308) return 12.92 * val;
     return 1.055 * Math.pow(val, 1.0 / 2.4) - 0.055;
   };
killedBy: colorConversion xyToRgb should convert red color correctly
statusReason: expected 255 to be greater than NaN

[Killed] ArithmeticOperator
utils/colorConversion.js:39:34
 
   // Apply gamma correction
   const gammaCorrect = (val) => {
-    if (val <= 0.0031308) return 12.92 * val;
+    if (val <= 0.0031308) return 12.92 / val;
     return 1.055 * Math.pow(val, 1.0 / 2.4) - 0.055;
   };
killedBy: colorConversion xyToRgb should scale brightness correctly at 0%
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ArithmeticOperator
utils/colorConversion.js:40:12
   // Apply gamma correction
   const gammaCorrect = (val) => {
     if (val <= 0.0031308) return 12.92 * val;
-    return 1.055 * Math.pow(val, 1.0 / 2.4) - 0.055;
+    return 1.055 / Math.pow(val, 1.0 / 2.4) - 0.055;
   };
 
killedBy: colorConversion xyToRgb should convert red color correctly
statusReason: expected 47 to be greater than 255

[Survived] ArithmeticOperator
utils/colorConversion.js:40:34
   // Apply gamma correction
   const gammaCorrect = (val) => {
     if (val <= 0.0031308) return 12.92 * val;
-    return 1.055 * Math.pow(val, 1.0 / 2.4) - 0.055;
+    return 1.055 * Math.pow(val, 1.0 * 2.4) - 0.055;
   };
 

[Survived] MethodExpression
utils/colorConversion.js:48:15
   b = gammaCorrect(b);
 
   // Normalize if any value is > 1
-  const max = Math.max(r, g, b);
+  const max = Math.min(r, g, b);
   if (max > 1) {
     r /= max;

[Killed] ConditionalExpression
utils/colorConversion.js:49:7
 
   // Normalize if any value is > 1
   const max = Math.max(r, g, b);
-  if (max > 1) {
+  if (true) {
     r /= max;
     g /= max;
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 245 to be less than 245

[Killed] EqualityOperator
utils/colorConversion.js:49:7
 
   // Normalize if any value is > 1
   const max = Math.max(r, g, b);
-  if (max > 1) {
+  if (max <= 1) {
     r /= max;
     g /= max;
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 255 to be less than 255

[Killed] AssignmentOperator
utils/colorConversion.js:50:5
   // Normalize if any value is > 1
   const max = Math.max(r, g, b);
   if (max > 1) {
-    r /= max;
+    r *= max;
     g /= max;
     b /= max;
killedBy: colorConversion xyToRgb should convert blue color correctly
statusReason: expected 255 to be greater than 255

[Survived] AssignmentOperator
utils/colorConversion.js:51:5
   const max = Math.max(r, g, b);
   if (max > 1) {
     r /= max;
-    g /= max;
+    g *= max;
     b /= max;
   }

[Survived] AssignmentOperator
utils/colorConversion.js:52:5
   if (max > 1) {
     r /= max;
     g /= max;
-    b /= max;
+    b *= max;
   }
 

[Killed] MethodExpression
utils/colorConversion.js:56:19
   }
 
   // Convert to 0-255 range
-  r = Math.max(0, Math.min(255, Math.round(r * 255)));
+  r = Math.max(0, Math.max(255, Math.round(r * 255)));
   g = Math.max(0, Math.min(255, Math.round(g * 255)));
   b = Math.max(0, Math.min(255, Math.round(b * 255)));
killedBy: colorConversion xyToRgb should convert blue color correctly
statusReason: expected 255 to be greater than 255

[Killed] MethodExpression
utils/colorConversion.js:56:7
   }
 
   // Convert to 0-255 range
-  r = Math.max(0, Math.min(255, Math.round(r * 255)));
+  r = Math.min(0, Math.min(255, Math.round(r * 255)));
   g = Math.max(0, Math.min(255, Math.round(g * 255)));
   b = Math.max(0, Math.min(255, Math.round(b * 255)));
killedBy: colorConversion xyToRgb should convert red color correctly
statusReason: expected 0 to be greater than 44

[Killed] MethodExpression
utils/colorConversion.js:57:19
 
   // Convert to 0-255 range
   r = Math.max(0, Math.min(255, Math.round(r * 255)));
-  g = Math.max(0, Math.min(255, Math.round(g * 255)));
+  g = Math.max(0, Math.max(255, Math.round(g * 255)));
   b = Math.max(0, Math.min(255, Math.round(b * 255)));
 
killedBy: colorConversion xyToRgb should convert red color correctly
statusReason: expected 255 to be greater than 255

[Killed] ArithmeticOperator
utils/colorConversion.js:57:44
 
   // Convert to 0-255 range
   r = Math.max(0, Math.min(255, Math.round(r * 255)));
-  g = Math.max(0, Math.min(255, Math.round(g * 255)));
+  g = Math.max(0, Math.min(255, Math.round(g / 255)));
   b = Math.max(0, Math.min(255, Math.round(b * 255)));
 
killedBy: colorConversion xyToRgb should scale brightness correctly at 50%
statusReason: expected 0 to be less than 0

[Killed] MethodExpression
utils/colorConversion.js:58:19
   // Convert to 0-255 range
   r = Math.max(0, Math.min(255, Math.round(r * 255)));
   g = Math.max(0, Math.min(255, Math.round(g * 255)));
-  b = Math.max(0, Math.min(255, Math.round(b * 255)));
+  b = Math.max(0, Math.max(255, Math.round(b * 255)));
 
   return { r, g, b };
killedBy: colorConversion xyToRgb should convert red color correctly
statusReason: expected 255 to be greater than 255

[Killed] ArithmeticOperator
utils/colorConversion.js:58:44
   // Convert to 0-255 range
   r = Math.max(0, Math.min(255, Math.round(r * 255)));
   g = Math.max(0, Math.min(255, Math.round(g * 255)));
-  b = Math.max(0, Math.min(255, Math.round(b * 255)));
+  b = Math.max(0, Math.min(255, Math.round(b / 255)));
 
   return { r, g, b };
killedBy: colorConversion xyToRgb should convert blue color correctly
statusReason: expected 0 to be greater than 64

[Killed] ArithmeticOperator
utils/colorConversion.js:71:18
  */
 export const mirekToRgb = (mirek, brightness = 100) => {
   // Convert mirek to Kelvin (mirek = 1,000,000 / Kelvin)
-  const kelvin = 1000000 / mirek;
+  const kelvin = 1000000 * mirek;
   const temp = kelvin / 100;
 
killedBy: colorConversion mirekToRgb should convert warm white (454 mirek / 2200K)
statusReason: expected 43 to be greater than 255

[Killed] ArithmeticOperator
utils/colorConversion.js:72:16
 export const mirekToRgb = (mirek, brightness = 100) => {
   // Convert mirek to Kelvin (mirek = 1,000,000 / Kelvin)
   const kelvin = 1000000 / mirek;
-  const temp = kelvin / 100;
+  const temp = kelvin * 100;
 
   let r, g, b;
killedBy: colorConversion mirekToRgb should convert warm white (454 mirek / 2200K)
statusReason: expected 64 to be greater than 255

[Killed] ConditionalExpression
utils/colorConversion.js:77:7
   let r, g, b;
 
   // Calculate red
-  if (temp <= 66) {
+  if (false) {
     r = 255;
   } else {
killedBy: colorConversion mirekToRgb should convert warm white (454 mirek / 2200K)
statusReason: expected NaN to be greater than 39

[Killed] BlockStatement
utils/colorConversion.js:77:19
   let r, g, b;
 
   // Calculate red
-  if (temp <= 66) {
-    r = 255;
-  } else {
+  if (temp <= 66) {} else {
     r = temp - 60;
     r = 329.698727446 * Math.pow(r, -0.1332047592);
killedBy: colorConversion mirekToRgb should convert warm white (454 mirek / 2200K)
statusReason: expected NaN to be greater than 39

[Survived] BlockStatement
utils/colorConversion.js:79:10
   // Calculate red
   if (temp <= 66) {
     r = 255;
-  } else {
-    r = temp - 60;
-    r = 329.698727446 * Math.pow(r, -0.1332047592);
-    r = Math.max(0, Math.min(255, r));
-  }
+  } else {}
 
   // Calculate green

[Survived] ArithmeticOperator
utils/colorConversion.js:80:9
   if (temp <= 66) {
     r = 255;
   } else {
-    r = temp - 60;
+    r = temp + 60;
     r = 329.698727446 * Math.pow(r, -0.1332047592);
     r = Math.max(0, Math.min(255, r));

[Survived] ArithmeticOperator
utils/colorConversion.js:81:9
     r = 255;
   } else {
     r = temp - 60;
-    r = 329.698727446 * Math.pow(r, -0.1332047592);
+    r = 329.698727446 / Math.pow(r, -0.1332047592);
     r = Math.max(0, Math.min(255, r));
   }

[Survived] UnaryOperator
utils/colorConversion.js:81:37
     r = 255;
   } else {
     r = temp - 60;
-    r = 329.698727446 * Math.pow(r, -0.1332047592);
+    r = 329.698727446 * Math.pow(r, +0.1332047592);
     r = Math.max(0, Math.min(255, r));
   }

[Survived] MethodExpression
utils/colorConversion.js:82:9
   } else {
     r = temp - 60;
     r = 329.698727446 * Math.pow(r, -0.1332047592);
-    r = Math.max(0, Math.min(255, r));
+    r = Math.min(0, Math.min(255, r));
   }
 

[Survived] MethodExpression
utils/colorConversion.js:82:21
   } else {
     r = temp - 60;
     r = 329.698727446 * Math.pow(r, -0.1332047592);
-    r = Math.max(0, Math.min(255, r));
+    r = Math.max(0, Math.max(255, r));
   }
 

[Killed] BlockStatement
utils/colorConversion.js:86:19
   }
 
   // Calculate green
-  if (temp <= 66) {
-    g = temp;
-    g = 99.4708025861 * Math.log(g) - 161.1195681661;
-  } else {
+  if (temp <= 66) {} else {
     g = temp - 60;
     g = 288.1221695283 * Math.pow(g, -0.0755148492);
killedBy: colorConversion mirekToRgb should scale brightness correctly
statusReason: expected NaN to be less than or equal to NaN

[Killed] EqualityOperator
utils/colorConversion.js:86:7
   }
 
   // Calculate green
-  if (temp <= 66) {
+  if (temp > 66) {
     g = temp;
     g = 99.4708025861 * Math.log(g) - 161.1195681661;
killedBy: colorConversion mirekToRgb should scale brightness correctly
statusReason: expected NaN to be less than or equal to NaN

[Survived] ArithmeticOperator
utils/colorConversion.js:88:9
   // Calculate green
   if (temp <= 66) {
     g = temp;
-    g = 99.4708025861 * Math.log(g) - 161.1195681661;
+    g = 99.4708025861 * Math.log(g) + 161.1195681661;
   } else {
     g = temp - 60;

[Survived] ArithmeticOperator
utils/colorConversion.js:88:9
   // Calculate green
   if (temp <= 66) {
     g = temp;
-    g = 99.4708025861 * Math.log(g) - 161.1195681661;
+    g = 99.4708025861 / Math.log(g) - 161.1195681661;
   } else {
     g = temp - 60;

[Survived] BlockStatement
utils/colorConversion.js:89:10
   if (temp <= 66) {
     g = temp;
     g = 99.4708025861 * Math.log(g) - 161.1195681661;
-  } else {
-    g = temp - 60;
-    g = 288.1221695283 * Math.pow(g, -0.0755148492);
-  }
+  } else {}
   g = Math.max(0, Math.min(255, g));
 

[Survived] ArithmeticOperator
utils/colorConversion.js:90:9
     g = temp;
     g = 99.4708025861 * Math.log(g) - 161.1195681661;
   } else {
-    g = temp - 60;
+    g = temp + 60;
     g = 288.1221695283 * Math.pow(g, -0.0755148492);
   }

[Survived] ArithmeticOperator
utils/colorConversion.js:91:9
     g = 99.4708025861 * Math.log(g) - 161.1195681661;
   } else {
     g = temp - 60;
-    g = 288.1221695283 * Math.pow(g, -0.0755148492);
+    g = 288.1221695283 / Math.pow(g, -0.0755148492);
   }
   g = Math.max(0, Math.min(255, g));

[Survived] UnaryOperator
utils/colorConversion.js:91:38
     g = 99.4708025861 * Math.log(g) - 161.1195681661;
   } else {
     g = temp - 60;
-    g = 288.1221695283 * Math.pow(g, -0.0755148492);
+    g = 288.1221695283 * Math.pow(g, +0.0755148492);
   }
   g = Math.max(0, Math.min(255, g));

[Survived] MethodExpression
utils/colorConversion.js:93:7
     g = temp - 60;
     g = 288.1221695283 * Math.pow(g, -0.0755148492);
   }
-  g = Math.max(0, Math.min(255, g));
+  g = Math.min(0, Math.min(255, g));
 
   // Calculate blue

[Survived] MethodExpression
utils/colorConversion.js:93:19
     g = temp - 60;
     g = 288.1221695283 * Math.pow(g, -0.0755148492);
   }
-  g = Math.max(0, Math.min(255, g));
+  g = Math.max(0, Math.max(255, g));
 
   // Calculate blue

[Killed] BlockStatement
utils/colorConversion.js:96:19
   g = Math.max(0, Math.min(255, g));
 
   // Calculate blue
-  if (temp >= 66) {
-    b = 255;
-  } else if (temp <= 19) {
+  if (temp >= 66) {} else if (temp <= 19) {
     b = 0;
   } else {
killedBy: colorConversion mirekToRgb should handle very cool temperatures (low mirek)
statusReason: expected NaN to be greater than or equal to 0

[Killed] ConditionalExpression
utils/colorConversion.js:96:7
   g = Math.max(0, Math.min(255, g));
 
   // Calculate blue
-  if (temp >= 66) {
+  if (true) {
     b = 255;
   } else if (temp <= 19) {
killedBy: colorConversion mirekToRgb should convert warm white (454 mirek / 2200K)
statusReason: expected 255 to be greater than 255

[Killed] ConditionalExpression
utils/colorConversion.js:98:14
   // Calculate blue
   if (temp >= 66) {
     b = 255;
-  } else if (temp <= 19) {
+  } else if (true) {
     b = 0;
   } else {
killedBy: colorConversion mirekToRgb should convert cool white (153 mirek / 6500K)
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
utils/colorConversion.js:98:14
   // Calculate blue
   if (temp >= 66) {
     b = 255;
-  } else if (temp <= 19) {
+  } else if (temp > 19) {
     b = 0;
   } else {
killedBy: colorConversion mirekToRgb should convert cool white (153 mirek / 6500K)
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
utils/colorConversion.js:100:10
     b = 255;
   } else if (temp <= 19) {
     b = 0;
-  } else {
-    b = temp - 10;
-    b = 138.5177312231 * Math.log(b) - 305.0447927307;
-    b = Math.max(0, Math.min(255, b));
-  }
+  } else {}
 
   // Apply brightness scaling
killedBy: colorConversion mirekToRgb should convert warm white (454 mirek / 2200K)
statusReason: expected 255 to be greater than NaN

[Survived] ArithmeticOperator
utils/colorConversion.js:101:9
   } else if (temp <= 19) {
     b = 0;
   } else {
-    b = temp - 10;
+    b = temp + 10;
     b = 138.5177312231 * Math.log(b) - 305.0447927307;
     b = Math.max(0, Math.min(255, b));

[Killed] ArithmeticOperator
utils/colorConversion.js:102:9
     b = 0;
   } else {
     b = temp - 10;
-    b = 138.5177312231 * Math.log(b) - 305.0447927307;
+    b = 138.5177312231 * Math.log(b) + 305.0447927307;
     b = Math.max(0, Math.min(255, b));
   }
killedBy: colorConversion mirekToRgb should convert warm white (454 mirek / 2200K)
statusReason: expected 255 to be greater than 255

[Killed] ArithmeticOperator
utils/colorConversion.js:102:9
     b = 0;
   } else {
     b = temp - 10;
-    b = 138.5177312231 * Math.log(b) - 305.0447927307;
+    b = 138.5177312231 / Math.log(b) - 305.0447927307;
     b = Math.max(0, Math.min(255, b));
   }
killedBy: colorConversion mirekToRgb should convert cool white (153 mirek / 6500K)
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
utils/colorConversion.js:103:9
   } else {
     b = temp - 10;
     b = 138.5177312231 * Math.log(b) - 305.0447927307;
-    b = Math.max(0, Math.min(255, b));
+    b = Math.min(0, Math.min(255, b));
   }
 
killedBy: colorConversion mirekToRgb should convert cool white (153 mirek / 6500K)
statusReason: expected 0 to be greater than 0

[Killed] MethodExpression
utils/colorConversion.js:103:21
   } else {
     b = temp - 10;
     b = 138.5177312231 * Math.log(b) - 305.0447927307;
-    b = Math.max(0, Math.min(255, b));
+    b = Math.max(0, Math.max(255, b));
   }
 
killedBy: colorConversion mirekToRgb should convert warm white (454 mirek / 2200K)
statusReason: expected 255 to be greater than 255

[Killed] ArithmeticOperator
utils/colorConversion.js:107:27
   }
 
   // Apply brightness scaling
-  const brightnessScale = brightness / 100;
+  const brightnessScale = brightness * 100;
   r = Math.round(r * brightnessScale);
   g = Math.round(g * brightnessScale);
killedBy: colorConversion mirekToRgb should convert warm white (454 mirek / 2200K)
statusReason: expected 2550000 to be less than or equal to 255

[Killed] ArithmeticOperator
utils/colorConversion.js:108:18
 
   // Apply brightness scaling
   const brightnessScale = brightness / 100;
-  r = Math.round(r * brightnessScale);
+  r = Math.round(r / brightnessScale);
   g = Math.round(g * brightnessScale);
   b = Math.round(b * brightnessScale);
killedBy: colorConversion mirekToRgb should scale brightness correctly
statusReason: expected 510 to be less than or equal to 255

[Killed] ArithmeticOperator
utils/colorConversion.js:109:18
   // Apply brightness scaling
   const brightnessScale = brightness / 100;
   r = Math.round(r * brightnessScale);
-  g = Math.round(g * brightnessScale);
+  g = Math.round(g / brightnessScale);
   b = Math.round(b * brightnessScale);
 
killedBy: colorConversion mirekToRgb should scale brightness correctly
statusReason: expected 412 to be less than or equal to 206

[Killed] ArithmeticOperator
utils/colorConversion.js:110:18
   const brightnessScale = brightness / 100;
   r = Math.round(r * brightnessScale);
   g = Math.round(g * brightnessScale);
-  b = Math.round(b * brightnessScale);
+  b = Math.round(b / brightnessScale);
 
   return { r, g, b };
killedBy: colorConversion mirekToRgb should scale brightness correctly
statusReason: expected 332 to be less than or equal to 166

[Killed] BooleanLiteral
utils/colorConversion.js:121:7
  * @returns {string|null} CSS rgb() color string or null
  */
 export const getLightColor = (light) => {
-  if (!light.on?.on) return null;
+  if (light.on?.on) return null;
 
   const brightness = light.dimming?.brightness ?? 100;
killedBy: colorConversion getLightColor should return null for lights that are off
statusReason: expected 'rgb(255, 245, 235)' to be null

[Killed] ConditionalExpression
utils/colorConversion.js:121:7
  * @returns {string|null} CSS rgb() color string or null
  */
 export const getLightColor = (light) => {
-  if (!light.on?.on) return null;
+  if (false) return null;
 
   const brightness = light.dimming?.brightness ?? 100;
killedBy: colorConversion getLightColor should return null for lights that are off
statusReason: expected 'rgb(255, 245, 235)' to be null

[Killed] OptionalChaining
utils/colorConversion.js:123:22
 export const getLightColor = (light) => {
   if (!light.on?.on) return null;
 
-  const brightness = light.dimming?.brightness ?? 100;
+  const brightness = light.dimming.brightness ?? 100;
 
   // Get actual light color
killedBy: colorConversion getLightColor should handle missing dimming data (default to 100)
statusReason: Cannot read properties of undefined (reading 'brightness')

[Killed] LogicalOperator
utils/colorConversion.js:123:22
 export const getLightColor = (light) => {
   if (!light.on?.on) return null;
 
-  const brightness = light.dimming?.brightness ?? 100;
+  const brightness = light.dimming?.brightness && 100;
 
   // Get actual light color
killedBy: colorConversion getLightColor should return warm dim color for very dim lights without color data
statusReason: expected 'rgb(255, 245, 235)' to match /^rgb\(255, 200, 130\)$/

[Killed] OptionalChaining
utils/colorConversion.js:127:7
 
   // Get actual light color
   let baseColor = null;
-  if (light.color?.xy) {
+  if (light.color.xy) {
     const { x, y } = light.color.xy;
     baseColor = xyToRgb(x, y, 100); // Full saturation first
killedBy: colorConversion getLightColor should return color for light with color temperature data
statusReason: Cannot read properties of undefined (reading 'xy')

[Killed] ConditionalExpression
utils/colorConversion.js:127:7
 
   // Get actual light color
   let baseColor = null;
-  if (light.color?.xy) {
+  if (true) {
     const { x, y } = light.color.xy;
     baseColor = xyToRgb(x, y, 100); // Full saturation first
killedBy: colorConversion getLightColor should return color for light with color temperature data
statusReason: Cannot read properties of undefined (reading 'xy')

[Killed] ConditionalExpression
utils/colorConversion.js:130:14
   if (light.color?.xy) {
     const { x, y } = light.color.xy;
     baseColor = xyToRgb(x, y, 100); // Full saturation first
-  } else if (light.color_temperature?.mirek) {
+  } else if (true) {
     baseColor = mirekToRgb(light.color_temperature.mirek, 100);
   }
killedBy: colorConversion getLightColor should return warm dim color for very dim lights without color data
statusReason: Cannot read properties of undefined (reading 'mirek')

[Killed] OptionalChaining
utils/colorConversion.js:130:14
   if (light.color?.xy) {
     const { x, y } = light.color.xy;
     baseColor = xyToRgb(x, y, 100); // Full saturation first
-  } else if (light.color_temperature?.mirek) {
+  } else if (light.color_temperature.mirek) {
     baseColor = mirekToRgb(light.color_temperature.mirek, 100);
   }
killedBy: colorConversion getLightColor should return warm dim color for very dim lights without color data
statusReason: Cannot read properties of undefined (reading 'mirek')

[Killed] BooleanLiteral
utils/colorConversion.js:135:7
   }
 
   // If no color data available, use intelligent fallback
-  if (!baseColor) {
+  if (baseColor) {
     // Assume neutral white as default - prevents green flash during API data load
     // Most color-capable lights default to neutral/warm white
killedBy: colorConversion getLightColor should return warm dim color for very dim lights without color data
statusReason: Cannot read properties of null (reading 'r')
