[Killed] BlockStatement
utils/colorConversion.js:135:19
   }
 
   // If no color data available, use intelligent fallback
-  if (!baseColor) {
-    // Assume neutral white as default - prevents green flash during API data load
-    // Most color-capable lights default to neutral/warm white
-    const DEFAULT_WHITE = COLOR_CONFIG.DEFAULT_WHITE;
-    const WARM_DIM_COLOR = COLOR_CONFIG.WARM_DIM;
-    const DIM_START = COLOR_CONFIG.DIM_THRESHOLD.START;
-    const BRIGHT_START = COLOR_CONFIG.DIM_THRESHOLD.BRIGHT_START;
-
-    // For dim lights, use warm candlelight color
-    if (brightness < DIM_START) {
-      return `rgb(${WARM_DIM_COLOR.r}, ${WARM_DIM_COLOR.g}, ${WARM_DIM_COLOR.b})`;
-    }
-    // For mid-range, blend between warm dim and neutral white
-    else if (brightness < BRIGHT_START) {
-      const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
-      const blendFactor = t * t * (3 - 2 * t);
-      const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
-      const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
-      const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);
-      return `rgb(${r}, ${g}, ${b})`;
-    }
-    // For bright lights, use neutral white until color data loads
-    return `rgb(${DEFAULT_WHITE.r}, ${DEFAULT_WHITE.g}, ${DEFAULT_WHITE.b})`;
-  }
+  if (!baseColor) {}
 
   // Calculate blend factor using smoothstep
killedBy: ColorService enrichLight should use fallback color when no color data present
statusReason: Cannot read properties of null (reading 'r')

[Killed] EqualityOperator
utils/colorConversion.js:144:9
     const BRIGHT_START = COLOR_CONFIG.DIM_THRESHOLD.BRIGHT_START;
 
     // For dim lights, use warm candlelight color
-    if (brightness < DIM_START) {
+    if (brightness >= DIM_START) {
       return `rgb(${WARM_DIM_COLOR.r}, ${WARM_DIM_COLOR.g}, ${WARM_DIM_COLOR.b})`;
     }
killedBy: colorConversion getLightColor should return warm dim color for very dim lights without color data
statusReason: expected 'rgb(255, 203, 137)' to match /^rgb\(255, 200, 130\)$/

[Killed] ConditionalExpression
utils/colorConversion.js:144:9
     const BRIGHT_START = COLOR_CONFIG.DIM_THRESHOLD.BRIGHT_START;
 
     // For dim lights, use warm candlelight color
-    if (brightness < DIM_START) {
+    if (false) {
       return `rgb(${WARM_DIM_COLOR.r}, ${WARM_DIM_COLOR.g}, ${WARM_DIM_COLOR.b})`;
     }
killedBy: colorConversion getLightColor should return warm dim color for very dim lights without color data
statusReason: expected 'rgb(255, 203, 137)' to match /^rgb\(255, 200, 130\)$/

[Killed] StringLiteral
utils/colorConversion.js:145:14
 
     // For dim lights, use warm candlelight color
     if (brightness < DIM_START) {
-      return `rgb(${WARM_DIM_COLOR.r}, ${WARM_DIM_COLOR.g}, ${WARM_DIM_COLOR.b})`;
+      return ``;
     }
     // For mid-range, blend between warm dim and neutral white
killedBy: colorConversion getLightColor should return warm dim color for very dim lights without color data
statusReason: expected '' to match /^rgb\(255, 200, 130\)$/

[Killed] ConditionalExpression
utils/colorConversion.js:148:14
       return `rgb(${WARM_DIM_COLOR.r}, ${WARM_DIM_COLOR.g}, ${WARM_DIM_COLOR.b})`;
     }
     // For mid-range, blend between warm dim and neutral white
-    else if (brightness < BRIGHT_START) {
+    else if (true) {
       const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
       const blendFactor = t * t * (3 - 2 * t);
killedBy: colorConversion getLightColor should return default white for bright lights without color data
statusReason: expected 'rgb(255, -293, -1020)' to match /^rgb\(255, 245, 235\)$/

[Killed] BlockStatement
utils/colorConversion.js:148:41
       return `rgb(${WARM_DIM_COLOR.r}, ${WARM_DIM_COLOR.g}, ${WARM_DIM_COLOR.b})`;
     }
     // For mid-range, blend between warm dim and neutral white
-    else if (brightness < BRIGHT_START) {
-      const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
-      const blendFactor = t * t * (3 - 2 * t);
-      const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
-      const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
-      const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);
-      return `rgb(${r}, ${g}, ${b})`;
-    }
+    else if (brightness < BRIGHT_START) {}
     // For bright lights, use neutral white until color data loads
     return `rgb(${DEFAULT_WHITE.r}, ${DEFAULT_WHITE.g}, ${DEFAULT_WHITE.b})`;
killedBy: colorConversion getLightColor should blend warm dim at mid brightness without color data
statusReason: expected 'rgb(255, 245, 235)' not to be 'rgb(255, 245, 235)' // Object.is equality

[Killed] ArithmeticOperator
utils/colorConversion.js:149:17
     }
     // For mid-range, blend between warm dim and neutral white
     else if (brightness < BRIGHT_START) {
-      const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
+      const t = (brightness - DIM_START) * (BRIGHT_START - DIM_START);
       const blendFactor = t * t * (3 - 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
killedBy: colorConversion getLightColor should blend warm dim at mid brightness without color data
statusReason: expected 'rgb(255, -12986071675, -30300834245)' to match /^rgb\(\d+, \d+, \d+\)$/

[Survived] ArithmeticOperator
utils/colorConversion.js:149:45
     }
     // For mid-range, blend between warm dim and neutral white
     else if (brightness < BRIGHT_START) {
-      const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
+      const t = (brightness - DIM_START) / (BRIGHT_START + DIM_START);
       const blendFactor = t * t * (3 - 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);

[Survived] ArithmeticOperator
utils/colorConversion.js:150:36
     // For mid-range, blend between warm dim and neutral white
     else if (brightness < BRIGHT_START) {
       const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
-      const blendFactor = t * t * (3 - 2 * t);
+      const blendFactor = t * t * (3 + 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
       const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);

[Survived] ArithmeticOperator
utils/colorConversion.js:150:40
     // For mid-range, blend between warm dim and neutral white
     else if (brightness < BRIGHT_START) {
       const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
-      const blendFactor = t * t * (3 - 2 * t);
+      const blendFactor = t * t * (3 - 2 / t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
       const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);

[Survived] ArithmeticOperator
utils/colorConversion.js:151:48
     else if (brightness < BRIGHT_START) {
       const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
       const blendFactor = t * t * (3 - 2 * t);
-      const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
+      const r = Math.round(WARM_DIM_COLOR.r * (1 + blendFactor) + DEFAULT_WHITE.r * blendFactor);
       const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
       const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);

[Survived] ArithmeticOperator
utils/colorConversion.js:151:67
     else if (brightness < BRIGHT_START) {
       const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
       const blendFactor = t * t * (3 - 2 * t);
-      const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
+      const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r / blendFactor);
       const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
       const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);

[Survived] ArithmeticOperator
utils/colorConversion.js:152:28
       const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
       const blendFactor = t * t * (3 - 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
-      const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
+      const g = Math.round(WARM_DIM_COLOR.g / (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
       const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);
       return `rgb(${r}, ${g}, ${b})`;

[Survived] ArithmeticOperator
utils/colorConversion.js:152:67
       const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
       const blendFactor = t * t * (3 - 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
-      const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
+      const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g / blendFactor);
       const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);
       return `rgb(${r}, ${g}, ${b})`;

[Killed] ArithmeticOperator
utils/colorConversion.js:153:28
       const blendFactor = t * t * (3 - 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
       const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
-      const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);
+      const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) - DEFAULT_WHITE.b * blendFactor);
       return `rgb(${r}, ${g}, ${b})`;
     }
killedBy: colorConversion getLightColor should blend warm dim at mid brightness without color data
statusReason: expected 'rgb(255, 218, -14)' to match /^rgb\(\d+, \d+, \d+\)$/

[Survived] ArithmeticOperator
utils/colorConversion.js:153:28
       const blendFactor = t * t * (3 - 2 * t);
       const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + DEFAULT_WHITE.r * blendFactor);
       const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + DEFAULT_WHITE.g * blendFactor);
-      const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);
+      const b = Math.round(WARM_DIM_COLOR.b / (1 - blendFactor) + DEFAULT_WHITE.b * blendFactor);
       return `rgb(${r}, ${g}, ${b})`;
     }

[Killed] StringLiteral
utils/colorConversion.js:157:12
       return `rgb(${r}, ${g}, ${b})`;
     }
     // For bright lights, use neutral white until color data loads
-    return `rgb(${DEFAULT_WHITE.r}, ${DEFAULT_WHITE.g}, ${DEFAULT_WHITE.b})`;
+    return ``;
   }
 
killedBy: ColorService enrichLight should use fallback color when no color data present
statusReason: expected '' to match /^rgb\(\d+, \d+, \d+\)$/

[Survived] ConditionalExpression
utils/colorConversion.js:166:7
   const BRIGHT_START = COLOR_CONFIG.DIM_THRESHOLD.BRIGHT_START;
 
   let blendFactor;
-  if (brightness <= DIM_START) {
+  if (true) {
     blendFactor = 0; // Pure warm
   } else if (brightness >= BRIGHT_START) {

[Survived] EqualityOperator
utils/colorConversion.js:166:7
   const BRIGHT_START = COLOR_CONFIG.DIM_THRESHOLD.BRIGHT_START;
 
   let blendFactor;
-  if (brightness <= DIM_START) {
+  if (brightness > DIM_START) {
     blendFactor = 0; // Pure warm
   } else if (brightness >= BRIGHT_START) {

[Killed] ConditionalExpression
utils/colorConversion.js:168:14
   let blendFactor;
   if (brightness <= DIM_START) {
     blendFactor = 0; // Pure warm
-  } else if (brightness >= BRIGHT_START) {
+  } else if (false) {
     blendFactor = 1; // Pure color
   } else {
killedBy: colorConversion getLightColor should return color for light with xy color data
statusReason: expected 'rgb(365, -391, -1239)' to match /^rgb\(\d+, \d+, \d+\)$/

[Killed] EqualityOperator
utils/colorConversion.js:168:14
   let blendFactor;
   if (brightness <= DIM_START) {
     blendFactor = 0; // Pure warm
-  } else if (brightness >= BRIGHT_START) {
+  } else if (brightness < BRIGHT_START) {
     blendFactor = 1; // Pure color
   } else {
killedBy: colorConversion getLightColor should return color for light with xy color data
statusReason: expected 'rgb(365, -391, -1239)' to match /^rgb\(\d+, \d+, \d+\)$/

[Killed] BlockStatement
utils/colorConversion.js:170:10
     blendFactor = 0; // Pure warm
   } else if (brightness >= BRIGHT_START) {
     blendFactor = 1; // Pure color
-  } else {
-    const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
-    blendFactor = t * t * (3 - 2 * t); // Smoothstep curve
-  }
+  } else {}
 
   // Blend colors (blending already accounts for perceived dimness)
killedBy: colorConversion getLightColor should blend colors at dim brightness with color data
statusReason: expected 'rgb(NaN, NaN, NaN)' to match /^rgb\(\d+, \d+, \d+\)$/

[Killed] ArithmeticOperator
utils/colorConversion.js:171:15
   } else if (brightness >= BRIGHT_START) {
     blendFactor = 1; // Pure color
   } else {
-    const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
+    const t = (brightness - DIM_START) * (BRIGHT_START - DIM_START);
     blendFactor = t * t * (3 - 2 * t); // Smoothstep curve
   }
killedBy: colorConversion getLightColor should blend colors at dim brightness with color data
statusReason: expected 'rgb(106269005, -573851050, -132835924…' to match /^rgb\(\d+, \d+, \d+\)$/

[Survived] ArithmeticOperator
utils/colorConversion.js:171:43
   } else if (brightness >= BRIGHT_START) {
     blendFactor = 1; // Pure color
   } else {
-    const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
+    const t = (brightness - DIM_START) / (BRIGHT_START + DIM_START);
     blendFactor = t * t * (3 - 2 * t); // Smoothstep curve
   }

[Survived] ArithmeticOperator
utils/colorConversion.js:172:28
     blendFactor = 1; // Pure color
   } else {
     const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
-    blendFactor = t * t * (3 - 2 * t); // Smoothstep curve
+    blendFactor = t * t * (3 + 2 * t); // Smoothstep curve
   }
 

[Survived] ArithmeticOperator
utils/colorConversion.js:172:19
     blendFactor = 1; // Pure color
   } else {
     const t = (brightness - DIM_START) / (BRIGHT_START - DIM_START);
-    blendFactor = t * t * (3 - 2 * t); // Smoothstep curve
+    blendFactor = t / t * (3 - 2 * t); // Smoothstep curve
   }
 

[Killed] ArithmeticOperator
utils/colorConversion.js:176:24
   }
 
   // Blend colors (blending already accounts for perceived dimness)
-  const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + baseColor.r * blendFactor);
+  const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) - baseColor.r * blendFactor);
   const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + baseColor.g * blendFactor);
   const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + baseColor.b * blendFactor);
killedBy: colorConversion getLightColor should return color for light with xy color data
statusReason: expected 'rgb(-245, 254, 255)' to match /^rgb\(\d+, \d+, \d+\)$/

[Killed] ArithmeticOperator
utils/colorConversion.js:176:24
   }
 
   // Blend colors (blending already accounts for perceived dimness)
-  const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + baseColor.r * blendFactor);
+  const r = Math.round(WARM_DIM_COLOR.r / (1 - blendFactor) + baseColor.r * blendFactor);
   const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + baseColor.g * blendFactor);
   const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + baseColor.b * blendFactor);
killedBy: colorConversion getLightColor should return color for light with xy color data
statusReason: expected 'rgb(Infinity, 254, 255)' to match /^rgb\(\d+, \d+, \d+\)$/

[Killed] ArithmeticOperator
utils/colorConversion.js:177:24
 
   // Blend colors (blending already accounts for perceived dimness)
   const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + baseColor.r * blendFactor);
-  const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + baseColor.g * blendFactor);
+  const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) - baseColor.g * blendFactor);
   const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + baseColor.b * blendFactor);
 
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected 'rgb(255, -44, 0)' to match /^rgb\(\d+, \d+, \d+\)$/

[Killed] ArithmeticOperator
utils/colorConversion.js:177:24
 
   // Blend colors (blending already accounts for perceived dimness)
   const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + baseColor.r * blendFactor);
-  const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + baseColor.g * blendFactor);
+  const g = Math.round(WARM_DIM_COLOR.g / (1 - blendFactor) + baseColor.g * blendFactor);
   const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + baseColor.b * blendFactor);
 
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected 'rgb(255, Infinity, 0)' to match /^rgb\(\d+, \d+, \d+\)$/

[Killed] ArithmeticOperator
utils/colorConversion.js:178:24
   // Blend colors (blending already accounts for perceived dimness)
   const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + baseColor.r * blendFactor);
   const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + baseColor.g * blendFactor);
-  const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + baseColor.b * blendFactor);
+  const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) - baseColor.b * blendFactor);
 
   return `rgb(${r}, ${g}, ${b})`;
killedBy: colorConversion getLightColor should return color for light with xy color data
statusReason: expected 'rgb(245, 254, -255)' to match /^rgb\(\d+, \d+, \d+\)$/

[Killed] ArithmeticOperator
utils/colorConversion.js:178:24
   // Blend colors (blending already accounts for perceived dimness)
   const r = Math.round(WARM_DIM_COLOR.r * (1 - blendFactor) + baseColor.r * blendFactor);
   const g = Math.round(WARM_DIM_COLOR.g * (1 - blendFactor) + baseColor.g * blendFactor);
-  const b = Math.round(WARM_DIM_COLOR.b * (1 - blendFactor) + baseColor.b * blendFactor);
+  const b = Math.round(WARM_DIM_COLOR.b / (1 - blendFactor) + baseColor.b * blendFactor);
 
   return `rgb(${r}, ${g}, ${b})`;
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected 'rgb(255, 44, Infinity)' to match /^rgb\(\d+, \d+, \d+\)$/

[Killed] BlockStatement
utils/colorConversion.js:189:54
  * @param {string} lightColor - CSS color string
  * @returns {string|null} CSS box-shadow string or null
  */
-export const getLightShadow = (light, lightColor) => {
-  if (!lightColor || !light.on?.on) return null;
-
-  const brightness = light.dimming?.brightness ?? 100;
-  const SHADOW_THRESHOLD = COLOR_CONFIG.SHADOW_THRESHOLD;
-
-  if (brightness < SHADOW_THRESHOLD) {
-    // Dim lights: neutral shadow only
-    return '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px 3px rgba(0, 0, 0, 0.1)';
-  } else {
-    // Bright lights: colored glow + depth shadow
-    const glowIntensity = Math.round(((brightness - SHADOW_THRESHOLD) / (100 - SHADOW_THRESHOLD)) * 40 + 20);
-    const glowOpacity = glowIntensity.toString(16).padStart(2, '0');
-    return `0 4px 12px ${lightColor}${glowOpacity}, 0 2px 4px rgba(0, 0, 0, 0.1)`;
-  }
-};
+export const getLightShadow = (light, lightColor) => {};
 
killedBy: ColorService enrichLight should enrich light with xy color data
statusReason: expected undefined to be truthy

[Killed] BooleanLiteral
utils/colorConversion.js:190:22
  * @returns {string|null} CSS box-shadow string or null
  */
 export const getLightShadow = (light, lightColor) => {
-  if (!lightColor || !light.on?.on) return null;
+  if (!lightColor || light.on?.on) return null;
 
   const brightness = light.dimming?.brightness ?? 100;
killedBy: colorConversion getLightShadow should return null for lights that are off
statusReason: expected '0 4px 12px rgb(255, 255, 255)3c, 0 2p…' to be null

[Killed] LogicalOperator
utils/colorConversion.js:190:7
  * @returns {string|null} CSS box-shadow string or null
  */
 export const getLightShadow = (light, lightColor) => {
-  if (!lightColor || !light.on?.on) return null;
+  if (!lightColor && !light.on?.on) return null;
 
   const brightness = light.dimming?.brightness ?? 100;
killedBy: colorConversion getLightShadow should return null for lights that are off
statusReason: expected '0 4px 12px rgb(255, 255, 255)3c, 0 2p…' to be null

[Killed] EqualityOperator
utils/colorConversion.js:195:7
   const brightness = light.dimming?.brightness ?? 100;
   const SHADOW_THRESHOLD = COLOR_CONFIG.SHADOW_THRESHOLD;
 
-  if (brightness < SHADOW_THRESHOLD) {
+  if (brightness <= SHADOW_THRESHOLD) {
     // Dim lights: neutral shadow only
     return '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px 3px rgba(0, 0, 0, 0.1)';
killedBy: colorConversion getLightShadow should handle brightness exactly at threshold
statusReason: expected '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px …' to contain '0 4px 12px'

[Killed] ConditionalExpression
utils/colorConversion.js:195:7
   const brightness = light.dimming?.brightness ?? 100;
   const SHADOW_THRESHOLD = COLOR_CONFIG.SHADOW_THRESHOLD;
 
-  if (brightness < SHADOW_THRESHOLD) {
+  if (true) {
     // Dim lights: neutral shadow only
     return '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px 3px rgba(0, 0, 0, 0.1)';
killedBy: colorConversion getLightShadow should return colored glow for bright lights
statusReason: expected '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px …' to contain 'rgb(255, 100, 50)'

[Killed] BlockStatement
utils/colorConversion.js:198:10
   if (brightness < SHADOW_THRESHOLD) {
     // Dim lights: neutral shadow only
     return '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px 3px rgba(0, 0, 0, 0.1)';
-  } else {
-    // Bright lights: colored glow + depth shadow
-    const glowIntensity = Math.round(((brightness - SHADOW_THRESHOLD) / (100 - SHADOW_THRESHOLD)) * 40 + 20);
-    const glowOpacity = glowIntensity.toString(16).padStart(2, '0');
-    return `0 4px 12px ${lightColor}${glowOpacity}, 0 2px 4px rgba(0, 0, 0, 0.1)`;
-  }
+  } else {}
 };
 
killedBy: colorConversion getLightShadow should return colored glow for bright lights
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArithmeticOperator
utils/colorConversion.js:200:39
     return '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px 3px rgba(0, 0, 0, 0.1)';
   } else {
     // Bright lights: colored glow + depth shadow
-    const glowIntensity = Math.round(((brightness - SHADOW_THRESHOLD) / (100 - SHADOW_THRESHOLD)) * 40 + 20);
+    const glowIntensity = Math.round(((brightness - SHADOW_THRESHOLD) * (100 - SHADOW_THRESHOLD)) * 40 + 20);
     const glowOpacity = glowIntensity.toString(16).padStart(2, '0');
     return `0 4px 12px ${lightColor}${glowOpacity}, 0 2px 4px rgba(0, 0, 0, 0.1)`;
killedBy: colorConversion getLightShadow should scale glow intensity with brightness
statusReason: Cannot read properties of null (reading '1')

[Killed] ArithmeticOperator
utils/colorConversion.js:200:38
     return '0 2px 6px rgba(0, 0, 0, 0.15), 0 1px 3px rgba(0, 0, 0, 0.1)';
   } else {
     // Bright lights: colored glow + depth shadow
-    const glowIntensity = Math.round(((brightness - SHADOW_THRESHOLD) / (100 - SHADOW_THRESHOLD)) * 40 + 20);
+    const glowIntensity = Math.round((brightness - SHADOW_THRESHOLD) / (100 - SHADOW_THRESHOLD) * 40 - 20);
     const glowOpacity = glowIntensity.toString(16).padStart(2, '0');
     return `0 4px 12px ${lightColor}${glowOpacity}, 0 2px 4px rgba(0, 0, 0, 0.1)`;
killedBy: colorConversion getLightShadow should scale glow intensity with brightness
statusReason: Cannot read properties of null (reading '1')

[Survived] StringLiteral
utils/colorConversion.js:201:64
   } else {
     // Bright lights: colored glow + depth shadow
     const glowIntensity = Math.round(((brightness - SHADOW_THRESHOLD) / (100 - SHADOW_THRESHOLD)) * 40 + 20);
-    const glowOpacity = glowIntensity.toString(16).padStart(2, '0');
+    const glowOpacity = glowIntensity.toString(16).padStart(2, "");
     return `0 4px 12px ${lightColor}${glowOpacity}, 0 2px 4px rgba(0, 0, 0, 0.1)`;
   }

[Killed] StringLiteral
utils/colorConversion.js:202:12
     // Bright lights: colored glow + depth shadow
     const glowIntensity = Math.round(((brightness - SHADOW_THRESHOLD) / (100 - SHADOW_THRESHOLD)) * 40 + 20);
     const glowOpacity = glowIntensity.toString(16).padStart(2, '0');
-    return `0 4px 12px ${lightColor}${glowOpacity}, 0 2px 4px rgba(0, 0, 0, 0.1)`;
+    return ``;
   }
 };
killedBy: colorConversion getLightShadow should return colored glow for bright lights
statusReason: expected '' to contain 'rgb(255, 100, 50)'
