[NoCoverage] BlockStatement
utils/errors.js:6:67
  */
 
 export class ApiError extends Error {
-  constructor(code, message, suggestion = null, statusCode = 500) {
-    super(message);
-    this.name = 'ApiError';
-    this.code = code;
-    this.suggestion = suggestion;
-    this.statusCode = statusCode;
-  }
+  constructor(code, message, suggestion = null, statusCode = 500) {}
 }
 

[NoCoverage] StringLiteral
utils/errors.js:8:17
 export class ApiError extends Error {
   constructor(code, message, suggestion = null, statusCode = 500) {
     super(message);
-    this.name = 'ApiError';
+    this.name = "";
     this.code = code;
     this.suggestion = suggestion;

[NoCoverage] BlockStatement
utils/errors.js:17:74
 
 // Authentication errors
 export class AuthenticationError extends ApiError {
-  constructor(message, suggestion = 'Check your bridge IP and username') {
-    super('authentication_error', message, suggestion, 401);
-  }
+  constructor(message, suggestion = 'Check your bridge IP and username') {}
 }
 

[NoCoverage] BlockStatement
utils/errors.js:23:24
 }
 
 export class MissingCredentialsError extends ApiError {
-  constructor(missing) {
-    super(
-      'missing_credentials',
-      `Missing required parameter: ${missing}`,
-      `Provide ${missing} in the request headers or query parameters`,
-      400
-    );
-  }
+  constructor(missing) {}
 }
 

[NoCoverage] BlockStatement
utils/errors.js:35:40
 
 // Bridge connection errors
 export class BridgeConnectionError extends ApiError {
-  constructor(bridgeIp, originalError) {
-    const message = `Cannot connect to Philips Hue Bridge at ${bridgeIp}`;
-    let suggestion = 'Check that the bridge IP address is correct and the bridge is powered on';
-
-    if (originalError?.code === 'ETIMEDOUT') {
-      suggestion = 'The bridge is not responding. Check your network connection and bridge IP address';
-    } else if (originalError?.code === 'ECONNREFUSED') {
-      suggestion = 'Connection refused. Verify the bridge IP address is correct';
-    }
-
-    super('bridge_connection_error', message, suggestion, 503);
-  }
+  constructor(bridgeIp, originalError) {}
 }
 

[NoCoverage] StringLiteral
utils/errors.js:37:22
 export class BridgeConnectionError extends ApiError {
   constructor(bridgeIp, originalError) {
     const message = `Cannot connect to Philips Hue Bridge at ${bridgeIp}`;
-    let suggestion = 'Check that the bridge IP address is correct and the bridge is powered on';
+    let suggestion = "";
 
     if (originalError?.code === 'ETIMEDOUT') {

[NoCoverage] BlockStatement
utils/errors.js:39:46
     const message = `Cannot connect to Philips Hue Bridge at ${bridgeIp}`;
     let suggestion = 'Check that the bridge IP address is correct and the bridge is powered on';
 
-    if (originalError?.code === 'ETIMEDOUT') {
-      suggestion = 'The bridge is not responding. Check your network connection and bridge IP address';
-    } else if (originalError?.code === 'ECONNREFUSED') {
+    if (originalError?.code === 'ETIMEDOUT') {} else if (originalError?.code === 'ECONNREFUSED') {
       suggestion = 'Connection refused. Verify the bridge IP address is correct';
     }

[NoCoverage] OptionalChaining
utils/errors.js:39:9
     const message = `Cannot connect to Philips Hue Bridge at ${bridgeIp}`;
     let suggestion = 'Check that the bridge IP address is correct and the bridge is powered on';
 
-    if (originalError?.code === 'ETIMEDOUT') {
+    if (originalError.code === 'ETIMEDOUT') {
       suggestion = 'The bridge is not responding. Check your network connection and bridge IP address';
     } else if (originalError?.code === 'ECONNREFUSED') {

[NoCoverage] StringLiteral
utils/errors.js:40:20
     let suggestion = 'Check that the bridge IP address is correct and the bridge is powered on';
 
     if (originalError?.code === 'ETIMEDOUT') {
-      suggestion = 'The bridge is not responding. Check your network connection and bridge IP address';
+      suggestion = "";
     } else if (originalError?.code === 'ECONNREFUSED') {
       suggestion = 'Connection refused. Verify the bridge IP address is correct';

[NoCoverage] ConditionalExpression
utils/errors.js:41:16
 
     if (originalError?.code === 'ETIMEDOUT') {
       suggestion = 'The bridge is not responding. Check your network connection and bridge IP address';
-    } else if (originalError?.code === 'ECONNREFUSED') {
+    } else if (true) {
       suggestion = 'Connection refused. Verify the bridge IP address is correct';
     }

[NoCoverage] ConditionalExpression
utils/errors.js:41:16
 
     if (originalError?.code === 'ETIMEDOUT') {
       suggestion = 'The bridge is not responding. Check your network connection and bridge IP address';
-    } else if (originalError?.code === 'ECONNREFUSED') {
+    } else if (false) {
       suggestion = 'Connection refused. Verify the bridge IP address is correct';
     }

[NoCoverage] StringLiteral
utils/errors.js:42:20
     if (originalError?.code === 'ETIMEDOUT') {
       suggestion = 'The bridge is not responding. Check your network connection and bridge IP address';
     } else if (originalError?.code === 'ECONNREFUSED') {
-      suggestion = 'Connection refused. Verify the bridge IP address is correct';
+      suggestion = "";
     }
 

[NoCoverage] BlockStatement
utils/errors.js:51:41
 
 // Resource errors
 export class ResourceNotFoundError extends ApiError {
-  constructor(resourceType, resourceId) {
-    super(
-      'resource_not_found',
-      `The ${resourceType} '${resourceId}' was not found`,
-      `Check the ${resourceType} ID or refresh the dashboard to get current ${resourceType}s`,
-      404
-    );
-  }
+  constructor(resourceType, resourceId) {}
 }
 

[NoCoverage] BlockStatement
utils/errors.js:62:37
 }
 
 export class InvalidResourceError extends ApiError {
-  constructor(resourceType, reason) {
-    super(
-      'invalid_resource',
-      `Invalid ${resourceType}: ${reason}`,
-      `Check the ${resourceType} data format`,
-      400
-    );
-  }
+  constructor(resourceType, reason) {}
 }
 

[NoCoverage] StringLiteral
utils/errors.js:65:7
   constructor(resourceType, reason) {
     super(
       'invalid_resource',
-      `Invalid ${resourceType}: ${reason}`,
+      ``,
       `Check the ${resourceType} data format`,
       400

[NoCoverage] BlockStatement
utils/errors.js:74:41
 
 // Data processing errors
 export class DataProcessingError extends ApiError {
-  constructor(operation, originalError) {
-    super(
-      'data_processing_error',
-      `Failed to ${operation}`,
-      'This might be a temporary issue. Try again in a moment',
-      500
-    );
-    this.originalError = originalError?.message;
-  }
+  constructor(operation, originalError) {}
 }
 

[NoCoverage] StringLiteral
utils/errors.js:76:7
 export class DataProcessingError extends ApiError {
   constructor(operation, originalError) {
     super(
-      'data_processing_error',
+      "",
       `Failed to ${operation}`,
       'This might be a temporary issue. Try again in a moment',

[NoCoverage] OptionalChaining
utils/errors.js:81:26
       'This might be a temporary issue. Try again in a moment',
       500
     );
-    this.originalError = originalError?.message;
+    this.originalError = originalError.message;
   }
 }

[NoCoverage] BlockStatement
utils/errors.js:87:17
 
 // Session errors
 export class InvalidSessionError extends ApiError {
-  constructor() {
-    super(
-      'invalid_session',
-      'Your session has expired or is invalid',
-      'Authenticate again to create a new session',
-      401
-    );
-  }
+  constructor() {}
 }
 

[NoCoverage] StringLiteral
utils/errors.js:89:7
 export class InvalidSessionError extends ApiError {
   constructor() {
     super(
-      'invalid_session',
+      "",
       'Your session has expired or is invalid',
       'Authenticate again to create a new session',

[NoCoverage] BlockStatement
utils/errors.js:98:17
 }
 
 export class SessionNotFoundError extends ApiError {
-  constructor() {
-    super(
-      'session_not_found',
-      'No active session found',
-      'Create a session by connecting to your bridge first',
-      401
-    );
-  }
+  constructor() {}
 }
 

[NoCoverage] StringLiteral
utils/errors.js:100:7
 export class SessionNotFoundError extends ApiError {
   constructor() {
     super(
-      'session_not_found',
+      "",
       'No active session found',
       'Create a session by connecting to your bridge first',

[NoCoverage] StringLiteral
utils/errors.js:102:7
     super(
       'session_not_found',
       'No active session found',
-      'Create a session by connecting to your bridge first',
+      "",
       401
     );

[NoCoverage] BlockStatement
utils/errors.js:110:30
 
 // Validation errors
 export class ValidationError extends ApiError {
-  constructor(field, reason) {
-    super(
-      'validation_error',
-      `Invalid ${field}: ${reason}`,
-      `Check the ${field} format and try again`,
-      400
-    );
-  }
+  constructor(field, reason) {}
 }
 

[NoCoverage] StringLiteral
utils/errors.js:113:7
   constructor(field, reason) {
     super(
       'validation_error',
-      `Invalid ${field}: ${reason}`,
+      ``,
       `Check the ${field} format and try again`,
       400

[NoCoverage] BlockStatement
utils/errors.js:122:32
 
 // Rate limiting
 export class RateLimitError extends ApiError {
-  constructor(retryAfter = 60) {
-    super(
-      'rate_limit_exceeded',
-      'Too many requests',
-      `Wait ${retryAfter} seconds before trying again`,
-      429
-    );
-    this.retryAfter = retryAfter;
-  }
+  constructor(retryAfter = 60) {}
 }
 

[NoCoverage] BlockStatement
utils/errors.js:137:34
  * Convert any error to a standardized API error response
  */
 export function toApiError(error) {
-  if (error instanceof ApiError) {
-    return error;
-  }
+  if (error instanceof ApiError) {}
 
   // Bridge connection errors

[NoCoverage] ConditionalExpression
utils/errors.js:137:7
  * Convert any error to a standardized API error response
  */
 export function toApiError(error) {
-  if (error instanceof ApiError) {
+  if (false) {
     return error;
   }

[NoCoverage] ConditionalExpression
utils/errors.js:142:40
   }
 
   // Bridge connection errors
-  if (error.code === 'ECONNREFUSED' || error.code === 'ETIMEDOUT') {
+  if (error.code === 'ECONNREFUSED' || false) {
     // Try to extract bridge IP from error message
     const bridgeIpMatch = error.message.match(/(\d+\.\d+\.\d+\.\d+)/);

[NoCoverage] EqualityOperator
utils/errors.js:142:40
   }
 
   // Bridge connection errors
-  if (error.code === 'ECONNREFUSED' || error.code === 'ETIMEDOUT') {
+  if (error.code === 'ECONNREFUSED' || error.code !== 'ETIMEDOUT') {
     // Try to extract bridge IP from error message
     const bridgeIpMatch = error.message.match(/(\d+\.\d+\.\d+\.\d+)/);

[NoCoverage] Regex
utils/errors.js:144:47
   // Bridge connection errors
   if (error.code === 'ECONNREFUSED' || error.code === 'ETIMEDOUT') {
     // Try to extract bridge IP from error message
-    const bridgeIpMatch = error.message.match(/(\d+\.\d+\.\d+\.\d+)/);
+    const bridgeIpMatch = error.message.match(/(\d+\.\d+\.\D+\.\d+)/);
     const bridgeIp = bridgeIpMatch ? bridgeIpMatch[1] : 'unknown';
     return new BridgeConnectionError(bridgeIp, error);

[NoCoverage] OptionalChaining
utils/errors.js:150:7
   }
 
   // Hue API errors
-  if (error.message?.includes('Bridge returned')) {
+  if (error.message.includes('Bridge returned')) {
     return new AuthenticationError(
       'Unable to communicate with the bridge',

[NoCoverage] ConditionalExpression
utils/errors.js:150:7
   }
 
   // Hue API errors
-  if (error.message?.includes('Bridge returned')) {
+  if (true) {
     return new AuthenticationError(
       'Unable to communicate with the bridge',

[NoCoverage] StringLiteral
utils/errors.js:152:7
   // Hue API errors
   if (error.message?.includes('Bridge returned')) {
     return new AuthenticationError(
-      'Unable to communicate with the bridge',
+      "",
       'Check your username/API key is valid'
     );

[NoCoverage] BlockStatement
utils/errors.js:157:49
     );
   }
 
-  if (error.message?.includes('Hue API error')) {
-    return new DataProcessingError('communicate with the bridge', error);
-  }
+  if (error.message?.includes('Hue API error')) {}
 
   // Generic errors

[NoCoverage] ConditionalExpression
utils/errors.js:157:7
     );
   }
 
-  if (error.message?.includes('Hue API error')) {
+  if (false) {
     return new DataProcessingError('communicate with the bridge', error);
   }

[NoCoverage] StringLiteral
utils/errors.js:158:36
   }
 
   if (error.message?.includes('Hue API error')) {
-    return new DataProcessingError('communicate with the bridge', error);
+    return new DataProcessingError("", error);
   }
 

[NoCoverage] StringLiteral
utils/errors.js:165:5
   return new ApiError(
     'internal_error',
     'An unexpected error occurred',
-    'Try again or contact support if the problem persists',
+    "",
     500
   );
