[Killed] BlockStatement
services/statsService.js:13:60
    * @param {Object} scenesData - Scenes data object
    * @returns {Object} Summary statistics
    */
-  calculateDashboardStats(lightsData, roomMap, scenesData) {
-    const totalLights = lightsData?.data?.length || 0;
-    const lightsOn = lightsData?.data?.filter(light => light.on?.on).length || 0;
-    const roomCount = roomMap ? Object.keys(roomMap).length : 0;
-    const sceneCount = scenesData?.data?.length || 0;
-
-    return {
-      totalLights,
-      lightsOn,
-      roomCount,
-      sceneCount
-    };
-  }
+  calculateDashboardStats(lightsData, roomMap, scenesData) {}
 }
 
killedBy: StatsService calculateDashboardStats should calculate stats for full dashboard data
statusReason: Cannot read properties of undefined (reading 'totalLights')

[Killed] ConditionalExpression
services/statsService.js:14:25
    * @returns {Object} Summary statistics
    */
   calculateDashboardStats(lightsData, roomMap, scenesData) {
-    const totalLights = lightsData?.data?.length || 0;
+    const totalLights = true;
     const lightsOn = lightsData?.data?.filter(light => light.on?.on).length || 0;
     const roomCount = roomMap ? Object.keys(roomMap).length : 0;
killedBy: StatsService calculateDashboardStats should calculate stats for full dashboard data
statusReason: expected true to be 4 // Object.is equality

[Killed] OptionalChaining
services/statsService.js:14:25
    * @returns {Object} Summary statistics
    */
   calculateDashboardStats(lightsData, roomMap, scenesData) {
-    const totalLights = lightsData?.data?.length || 0;
+    const totalLights = lightsData.data?.length || 0;
     const lightsOn = lightsData?.data?.filter(light => light.on?.on).length || 0;
     const roomCount = roomMap ? Object.keys(roomMap).length : 0;
killedBy: StatsService calculateDashboardStats should return zeros for null inputs
statusReason: Cannot read properties of null (reading 'data')

[Killed] OptionalChaining
services/statsService.js:15:22
    */
   calculateDashboardStats(lightsData, roomMap, scenesData) {
     const totalLights = lightsData?.data?.length || 0;
-    const lightsOn = lightsData?.data?.filter(light => light.on?.on).length || 0;
+    const lightsOn = lightsData?.data.filter(light => light.on?.on).length || 0;
     const roomCount = roomMap ? Object.keys(roomMap).length : 0;
     const sceneCount = scenesData?.data?.length || 0;
killedBy: StatsService calculateDashboardStats should handle missing data properties
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
services/statsService.js:15:22
    */
   calculateDashboardStats(lightsData, roomMap, scenesData) {
     const totalLights = lightsData?.data?.length || 0;
-    const lightsOn = lightsData?.data?.filter(light => light.on?.on).length || 0;
+    const lightsOn = true;
     const roomCount = roomMap ? Object.keys(roomMap).length : 0;
     const sceneCount = scenesData?.data?.length || 0;
killedBy: StatsService calculateDashboardStats should calculate stats for full dashboard data
statusReason: expected true to be 3 // Object.is equality

[Killed] ConditionalExpression
services/statsService.js:17:24
     const totalLights = lightsData?.data?.length || 0;
     const lightsOn = lightsData?.data?.filter(light => light.on?.on).length || 0;
     const roomCount = roomMap ? Object.keys(roomMap).length : 0;
-    const sceneCount = scenesData?.data?.length || 0;
+    const sceneCount = true;
 
     return {
killedBy: StatsService calculateDashboardStats should calculate stats for full dashboard data
statusReason: expected true to be 3 // Object.is equality

[Killed] LogicalOperator
services/statsService.js:17:24
     const totalLights = lightsData?.data?.length || 0;
     const lightsOn = lightsData?.data?.filter(light => light.on?.on).length || 0;
     const roomCount = roomMap ? Object.keys(roomMap).length : 0;
-    const sceneCount = scenesData?.data?.length || 0;
+    const sceneCount = scenesData?.data?.length && 0;
 
     return {
killedBy: StatsService calculateDashboardStats should calculate stats for full dashboard data
statusReason: expected +0 to be 3 // Object.is equality
