[Killed] BlockStatement
utils/validation.js:12:35
  * @param {string} ip - IP address to validate
  * @returns {boolean} True if valid IP address
  */
-export const validateIp = (ip) => {
-  if (!VALIDATION.IP_REGEX.test(ip)) return false;
-
-  // Check each octet is 0-255
-  const octets = ip.split('.');
-  return octets.every(octet => {
-    const num = parseInt(octet, 10);
-    return num >= VALIDATION.IP_OCTET_MIN && num <= VALIDATION.IP_OCTET_MAX;
-  });
-};
+export const validateIp = (ip) => {};
 
killedBy: validation validateIp should accept valid IP addresses
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
utils/validation.js:13:7
  * @returns {boolean} True if valid IP address
  */
 export const validateIp = (ip) => {
-  if (!VALIDATION.IP_REGEX.test(ip)) return false;
+  if (true) return false;
 
   // Check each octet is 0-255
killedBy: validation validateIp should accept valid IP addresses
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
utils/validation.js:13:7
  * @returns {boolean} True if valid IP address
  */
 export const validateIp = (ip) => {
-  if (!VALIDATION.IP_REGEX.test(ip)) return false;
+  if (VALIDATION.IP_REGEX.test(ip)) return false;
 
   // Check each octet is 0-255
killedBy: validation validateIp should accept valid IP addresses
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
utils/validation.js:17:10
 
   // Check each octet is 0-255
   const octets = ip.split('.');
-  return octets.every(octet => {
-    const num = parseInt(octet, 10);
-    return num >= VALIDATION.IP_OCTET_MIN && num <= VALIDATION.IP_OCTET_MAX;
-  });
+  return octets.some(octet => {
+  const num = parseInt(octet, 10);
+  return num >= VALIDATION.IP_OCTET_MIN && num <= VALIDATION.IP_OCTET_MAX;
+});
 };
 
killedBy: validation validateIp should reject octets out of range
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
utils/validation.js:17:32
 
   // Check each octet is 0-255
   const octets = ip.split('.');
-  return octets.every(octet => {
-    const num = parseInt(octet, 10);
-    return num >= VALIDATION.IP_OCTET_MIN && num <= VALIDATION.IP_OCTET_MAX;
-  });
+  return octets.every(octet => {});
 };
 
killedBy: validation validateIp should accept valid IP addresses
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
utils/validation.js:19:46
   const octets = ip.split('.');
   return octets.every(octet => {
     const num = parseInt(octet, 10);
-    return num >= VALIDATION.IP_OCTET_MIN && num <= VALIDATION.IP_OCTET_MAX;
+    return num >= VALIDATION.IP_OCTET_MIN && true;
   });
 };
killedBy: validation validateIp should reject octets out of range
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
utils/validation.js:19:12
   const octets = ip.split('.');
   return octets.every(octet => {
     const num = parseInt(octet, 10);
-    return num >= VALIDATION.IP_OCTET_MIN && num <= VALIDATION.IP_OCTET_MAX;
+    return true;
   });
 };
killedBy: validation validateIp should reject octets out of range
statusReason: expected true to be false // Object.is equality
